serggggaae/ESP32-MiniWebRadio/main.cpp
uint16_t _sleeptimeXPos[5] = {20, 137, 223, 106};
uint16_t _sleeptimeYPos = 112;
uint16_t _dispWidth   = 800;
uint16_t _dispHeight  = 480;
uint8_t  _BrightnessMin = 25; // slider Brightness left value
const char _tftSize[2] = "l";
//
// clang-format on
#endif // #if TFT_CONTROLLER == 2 || TFT_CONTROLLER == 3 || TFT_CONTROLLER == 4 || TFT_CONTROLLER == 5|| TFT_CONTROLLER == 6

// ALL STATE
displayHeader   dispHeader("dispHeader", _headerFontSize); // 0 -> autoSize
displayFooter   dispFooter("dispFooter", _footerFontSize); // 0 -> autoSize
numbersBox      volBox("volBox");
uniList         myList("myList");
// RADIO
button2state    btn_RA_mute("btn_RA_mute");
button1state    btn_RA_prevSta("btn_RA_prevSta"), btn_RA_nextSta("btn_RA_nextSta");
button1state    btn_RA_staList("btn_RA_staList"), btn_RA_player("btn_RA_player"), btn_RA_dlna("btn_RA_dlna"), btn_RA_clock("btn_RA_clock");
button1state    btn_RA_sleep("btn_RA_sleep"), btn_RA_bt("btn_RA_bt");
button1state    btn_RA_off("btn_RA_off"), btn_RA_settings("btn_RA_settings");
pictureBox      pic_RA_logo("pic_RA_logo");
textbox         txt_RA_sTitle("txt_RA_sTitle"), txt_RA_staName("txt_RA_staName"), txt_RA_irNum("txt_RA_irNum");
vuMeter         VUmeter_RA("VUmeter_RA");
slider          sdr_RA_volume("sdr_RA_volume");
// STATIONSLIST
stationsList    lst_RADIO("lst_RADIO");
// PLAYER
button2state    btn_PL_mute("btn_PL_mute"), btn_PL_pause("btn_PL_pause");
button1state    btn_PL_ready("btn_PL_ready"), btn_PL_shuffle("btn_PL_shuffle");
button1state    btn_PL_playAll("btn_PL_playAll"), btn_PL_fileList("btn_PL_fileList"), btn_PL_radio("btn_PL_radio"), btn_PL_cancel("btn_PL_cancel");
button1state    btn_PL_prevFile("btn_PL_prevFile"), btn_PL_nextFile("btn_PL_nextFile"), btn_PL_off("btn_PL_off");
button1state    btn_PL_playNext("btn_PL_playNext"), btn_PL_playPrev("btn_PL_playPrev");
textbox         txt_PL_fName("txt_PL_fName");
textbox         txt_PL_fNumber("txt_PL_fNumber");
slider          sdr_PL_volume("sdr_PL_volume");
pictureBox      pic_PL_logo("pic_PL_logo");
progressbar     pgb_PL_progress("pgb_PL_progress");
// AUDIOFILESLIST
fileList        lst_PLAYER("lst_PLAYER");
// DLNA
button2state    btn_DL_mute("btn_DL_mute"), btn_DL_pause("btn_DL_pause");
button1state    btn_DL_radio("btn_DL_radio"), btn_DL_fileList("btn_DL_fileList"), btn_DL_cancel("btn_DL_cancel");
textbox         txt_DL_fName("txt_DL_fName");
slider          sdr_DL_volume("sdr_DL_volume");
pictureBox      pic_DL_logo("pic_DL_logo");
progressbar     pgb_DL_progress("pgb_DL_progress");
// DLNAITEMSLIST
dlnaList        lst_DLNA("lst_DLNA", &dlna, &_dlnaHistory[0], 10);
// CLOCK
imgClock24      clk_CL_24("clk_CL_24");
imgClock12      clk_CL_12("clk_CL_12");
button2state    btn_CL_mute("btn_CL_mute");
button1state    btn_CL_alarm("btn_CL_alarm"), btn_CL_radio("btn_CL_radio"), btn_CL_off("btn_CL_off");
slider          sdr_CL_volume("sdr_CL_volume");
// ALARMCLOCK
alarmClock      clk_AC_red("clk_AC_red");
button1state    btn_AC_left("btn_AC_left"), btn_AC_right("btn_AC_right"), btn_AC_up("btn_AC_up"), btn_AC_down("btn_AC_down");
button1state    btn_AC_ready("btn_AC_ready");
// RINGING
pictureBox      pic_RI_logo("pic_RI_logo");
imgClock24small clk_RI_24small("clk_RI_24small");
// SETTINGS
pictureBox      pic_SE_logo("pic_SE_logo");
button1state    btn_SE_bright("btn_SE_bright"), btn_SE_equal("btn_SE_equal"), btn_SE_wifi("btn_SE_wifi"), btn_SE_radio("btn_SE_radio");
// BRIGHTNESS
button1state    btn_BR_ready("btn_BR_ready");
pictureBox      pic_BR_logo("pic_BR_logo");
slider          sdr_BR_value("sdr_BR_value");
textbox         txt_BR_value("txt_BR_value");
// SLEEPTIMER
button1state    btn_SL_up("btn_SL_up"), btn_SL_down("btn_SL_down"), btn_SL_ready("btn_SL_ready"), btn_SL_cancel("btn_SL_cancel");
// EQUALIZER
slider          sdr_EQ_lowPass("sdr_E_LP"), sdr_EQ_bandPass("sdr_E_BP"), sdr_EQ_highPass("sdr_E_HP"), sdr_EQ_balance("sdr_E_BAL");
textbox         txt_EQ_lowPass("txt_E_LP"), txt_EQ_bandPass("txt_E_BP"), txt_EQ_highPass("txt_E_HP"), txt_EQ_balance("txt_E_BAL");
button1state    btn_EQ_lowPass("btn_E_LP");
button1state    btn_EQ_bandPass("btn_E_BP"), btn_EQ_highPass("btn_E_HP"), btn_EQ_balance("btn_E_BAL");
button1state    btn_EQ_Radio("btn_EQ_Radio"), btn_EQ_Player("btn_EQ_Player");
button2state    btn_EQ_mute("btn_EQ_mute");
// BLUETOOTH
button2state    btn_BT_pause("btn_BT_pause"), btn_BT_power("btn_BT_power");
button1state    btn_BT_volDown("btn_BT_volDown"), btn_BT_volUp("btn_BT_volUp"), btn_BT_radio("btn_BT_radio"), btn_BT_mode("btn_BT_mode");
pictureBox      pic_BT_mode("pic_BT_mode");
textbox         txt_BT_mode("txt_BT_mode");
textbox         txt_BT_volume("txt_BT_volume");
// IR_SETTINGS
button1state    btn_IR_radio("btn_IR_radio");
// WIFI_SETTINGS
wifiSettings    cls_wifiSettings("wifiSettings", 2);

/*  ╔═══════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════╗
    ║                                                     D E F A U L T S E T T I N G S                                                         ║
    ╚═══════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════╝   */

// clang-format off  🟢🟡🔴
boolean defaultsettings(){

    if(!SD_MMC.exists("/ir_buttons.json")){  // if not found ir_buttons.json create a default file
        File file = SD_MMC.open("/ir_buttons.json", "w", true);
        file.write((uint8_t*)ir_buttons_json, sizeof(ir_buttons_json));
        file.close();
    }
    irb.loadButtonsFromJSON("/ir_buttons.json");
    for(uint i = 0; i < _settings.numOfIrButtons; i++) {
    //    log_w("0x%04X,  %s", _settings.irbuttons[i].val, _settings.irbuttons[i].label);
        ir.set_irButtons(i, _settings.irbuttons[i].val);
    }
        ir.set_irAddress(_settings.irbuttons[42].val);
    //    log_w("0x%04X,  %s", _settings.irbuttons[42].val, _settings.irbuttons[42].label);

    if(!SD_MMC.exists("/settings.json")){  // if not found create one
        updateSettings();
    }

