serggggaae/ESP32-MiniWebRadio/main.cpp
    File file2 = SD_MMC.open("/settings.json","r", false);
    char*  jO = x_ps_calloc(2048, 1);
    char* tmp = x_ps_malloc(1024);
    file2.readBytes(jO, 2048);
    _settingsHash = simpleHash(jO);
    file2.close();

    auto parseJson = [&](const char* s) { // lambda, inner function
        int16_t pos1 = 0, pos2 = 0, pos3 = 0;
        pos1 = indexOf(jO, s, 0);
        if(pos1 < 0) {log_e("index %s not found", s); return "0";}
        pos2 = indexOf(jO, ":", pos1) + 1;
        if(jO[pos2] == '\"') pos3 = indexOf(jO, "\"", pos2 + 1) + 1;
        else pos3 = indexOf(jO, ",", pos2);
        if(pos3 < 0) pos3 = find_first_of(jO, "}\n", pos2);
        if(jO[pos2] == '\"'){pos2++; pos3--;}  // remove \" embraced strings
        strncpy(tmp, jO + pos2, pos3 - pos2);
        tmp[pos3 - pos2] = '\0';
        return (const char*)tmp;
    };

    auto computeMinuteOfTheDay = [&](const char* s){
        if(!s) return 0;
        int h = atoi(s);
        int m = atoi(s + 3);
        return h * 60 + m;
    };

    x_ps_free(&_settings.lastconnectedhost);
    x_ps_free(&_settings.lastconnectedfile);

    _cur_volume                 = atoi(   parseJson("\"volume\":"));
    _volumeSteps                = atoi(   parseJson("\"volumeSteps\":"));
    _ringVolume                 = atoi(   parseJson("\"ringVolume\":"));
    _volumeAfterAlarm           = atoi(   parseJson("\"volumeAfterAlarm\":"));
    _BTvolume                   = atoi(   parseJson("\"BTvolume\":"));
    _f_BTpower                  = (strcmp(parseJson("\"BTpower\":"), "true") == 0) ? 1 : 0;
    _btEmitterMode              = ((strcmp(parseJson("\"BTmode\":"), "TX") == 0) ? "TX" : "RX");
    _alarmtime[0]               = computeMinuteOfTheDay(parseJson("\"alarmtime_sun\":"));
    _alarmtime[1]               = computeMinuteOfTheDay(parseJson("\"alarmtime_mon\":"));
    _alarmtime[2]               = computeMinuteOfTheDay(parseJson("\"alarmtime_tue\":"));
    _alarmtime[3]               = computeMinuteOfTheDay(parseJson("\"alarmtime_wed\":"));
    _alarmtime[4]               = computeMinuteOfTheDay(parseJson("\"alarmtime_thu\":"));
    _alarmtime[5]               = computeMinuteOfTheDay(parseJson("\"alarmtime_fri\":"));
    _alarmtime[6]               = computeMinuteOfTheDay(parseJson("\"alarmtime_sat\":"));
    _alarmdays                  = atoi(       parseJson("\"alarm_weekdays\":"));
	_offAlarmDays 				= atoi(parseJson("\"offAlarmDays\":"));
	_offAlarmTime[0] 			= computeMinuteOfTheDay(parseJson("\"offAlarmTime_sun\":"));
	_offAlarmTime[1] 			= computeMinuteOfTheDay(parseJson("\"offAlarmTime_mon\":"));
	_offAlarmTime[2] 			= computeMinuteOfTheDay(parseJson("\"offAlarmTime_tue\":"));
	_offAlarmTime[3] 			= computeMinuteOfTheDay(parseJson("\"offAlarmTime_wed\":"));
	_offAlarmTime[4] 			= computeMinuteOfTheDay(parseJson("\"offAlarmTime_thu\":"));
	_offAlarmTime[5] 			= computeMinuteOfTheDay(parseJson("\"offAlarmTime_fri\":"));
	_offAlarmTime[6] 			= computeMinuteOfTheDay(parseJson("\"offAlarmTime_sat\":"));
    _f_timeAnnouncement         = (strcmp(    parseJson("\"timeAnnouncing\":"), "true") == 0) ? 1 : 0;
    strcpy(_timeSpeechLang,                   parseJson("\"timeSpeechLang\":"));
    _f_mute                     = (strcmp(    parseJson("\"mute\":"), "true") == 0) ? 1 : 0;
	fall_asleeps                     = (strcmp(    parseJson("\"fall_asleeps\":"), "true") == 0) ? 1 : 0;
    _brightness                 = atoi(       parseJson("\"brightness\":"));
	_brightness2                 = atoi(       parseJson("\"brightness2\":"));
	_disptimer                 = atoi(       parseJson("\"_disptimer\":"));
	_disptimer3                 = atoi(       parseJson("\"_disptimer3\":"));
	disptimer                  = (strcmp(parseJson("\"disptimer\":"), "true") == 0) ? 1 : 0;
    _sleeptime                  = atoi(       parseJson("\"sleeptime\":"));
    _cur_station                = atoi(       parseJson("\"station\":"));
	Stationold1                = atoi(       parseJson("\"Stationold1\":"));
	Stationold2                = atoi(       parseJson("\"Stationold2\":"));
	Stationold3                = atoi(       parseJson("\"Stationold3\":"));
	Audiold1                = atoi(       parseJson("\"Audiold1\":"));
	Audiold2                = atoi(       parseJson("\"Audiold2\":"));
	Audiold3                = atoi(       parseJson("\"Audiold3\":"));
    _toneLP                     = atoi(       parseJson("\"toneLP\":"));
    _toneBP                     = atoi(       parseJson("\"toneBP\":"));
    _toneHP                     = atoi(       parseJson("\"toneHP\":"));
    _toneBAL                    = atoi(       parseJson("\"balance\":"));
    _timeFormat                 = atoi(       parseJson("\"timeFormat\":"));
    _TZName                     =             parseJson("\"Timezone_Name\":");
    _TZString                   =             parseJson("\"Timezone_String\":");
    _settings.lastconnectedhost = x_ps_strdup(parseJson("\"lastconnectedhost\":"));
    _settings.lastconnectedfile = x_ps_strdup(parseJson("\"lastconnectedfile\":"));
    _sleepMode                  = atoi(       parseJson("\"sleepMode\":"));
    _state                      = atoi(       parseJson("\"state\":"));
    _state2                      = atoi(       parseJson("\"state2\":"));
    _state1                      = atoi(       parseJson("\"state1\":"));

    // set some items ---------------------------------------------------------------------------------------------
    if(!startsWith(_settings.lastconnectedfile, "/")) {x_ps_free(&_settings.lastconnectedfile); _settings.lastconnectedfile = x_ps_strdup("/audiofiles/");} // guard
    _SD_content.setLastConnectedFile(_settings.lastconnectedfile);
    x_ps_free(&_cur_AudioFolder); _cur_AudioFolder = x_ps_strdup(_SD_content.getLastConnectedFolder());
    x_ps_free(&_cur_AudioFileName); _cur_AudioFileName = x_ps_strdup(_SD_content.getLastConnectedFileName());
    _cur_AudioFileNr = _SD_content.getPosByFileName(_cur_AudioFileName);
    // ------------------------------------------------------------------------------------------------------------
    x_ps_free(&jO);
    x_ps_free(&tmp);

    staMgnt.updateStationsList();
    return true;
}
// clang-format on  🟢🟡🔴

