serggggaae/ESP32-MiniWebRadio/main.cpp
// clang-format off  🟢🟡🔴
void updateSettings(){
    if(!_settings.lastconnectedhost) _settings.lastconnectedhost= strdup("");
    if(!_settings.lastconnectedfile) _settings.lastconnectedfile= strdup("/audiofiles/");
    char*  jO = x_ps_malloc(2048 + strlen(_settings.lastconnectedhost)); // JSON Object
    char tmp[40 + strlen(_settings.lastconnectedhost)];
    strcpy(jO,   "{\n");
    sprintf(tmp, "  \"volume\":%i", _cur_volume);                                                   strcat(jO, tmp);
    sprintf(tmp, ",\n  \"volumeSteps\":%i", _volumeSteps);                                          strcat(jO, tmp);
    sprintf(tmp, ",\n  \"ringVolume\":%i", _ringVolume);                                            strcat(jO, tmp);
    sprintf(tmp, ",\n  \"volumeAfterAlarm\":%i", _volumeAfterAlarm);                                strcat(jO, tmp);
    sprintf(tmp, ",\n  \"BTvolume\":%i", _BTvolume);                                                strcat(jO, tmp);
    strcat(jO,   ",\n  \"BTpower\":"); (_f_BTpower == true) ?                                       strcat(jO, "\"true\"") : strcat(jO, "\"false\"");
    sprintf(tmp, ",\n  \"BTmode\":\"%s\"", bt_emitter.getMode());                                   strcat(jO, tmp);
    sprintf(tmp, ",\n  \"alarmtime_sun\":\"%02d:%02d\"", _alarmtime[0] / 60, _alarmtime[0] % 60);   strcat(jO, tmp);
    sprintf(tmp, ",\n  \"alarmtime_mon\":\"%02d:%02d\"", _alarmtime[1] / 60, _alarmtime[1] % 60);   strcat(jO, tmp);
    sprintf(tmp, ",\n  \"alarmtime_tue\":\"%02d:%02d\"", _alarmtime[2] / 60, _alarmtime[2] % 60);   strcat(jO, tmp);
    sprintf(tmp, ",\n  \"alarmtime_wed\":\"%02d:%02d\"", _alarmtime[3] / 60, _alarmtime[3] % 60);   strcat(jO, tmp);
    sprintf(tmp, ",\n  \"alarmtime_thu\":\"%02d:%02d\"", _alarmtime[4] / 60, _alarmtime[4] % 60);   strcat(jO, tmp);
    sprintf(tmp, ",\n  \"alarmtime_fri\":\"%02d:%02d\"", _alarmtime[5] / 60, _alarmtime[5] % 60);   strcat(jO, tmp);
    sprintf(tmp, ",\n  \"alarmtime_sat\":\"%02d:%02d\"", _alarmtime[6] / 60, _alarmtime[6] % 60);   strcat(jO, tmp);
    sprintf(tmp, ",\n  \"alarm_weekdays\":%i", _alarmdays);                                         strcat(jO, tmp);
	sprintf(tmp, ",\n  \"offAlarmDays\":%i", _offAlarmDays);   										strcat(jO, tmp);
	sprintf(tmp, ",\n  \"offAlarmTime_sun\":\"%02d:%02d\"", _offAlarmTime[0]/60, _offAlarmTime[0]%60);   strcat(jO, tmp);
	sprintf(tmp, ",\n  \"offAlarmTime_mon\":\"%02d:%02d\"", _offAlarmTime[1]/60, _offAlarmTime[1]%60);   strcat(jO, tmp);
	sprintf(tmp, ",\n  \"offAlarmTime_tue\":\"%02d:%02d\"", _offAlarmTime[2]/60, _offAlarmTime[2]%60);   strcat(jO, tmp);
	sprintf(tmp, ",\n  \"offAlarmTime_wed\":\"%02d:%02d\"", _offAlarmTime[3]/60, _offAlarmTime[3]%60);   strcat(jO, tmp);
	sprintf(tmp, ",\n  \"offAlarmTime_thu\":\"%02d:%02d\"", _offAlarmTime[4]/60, _offAlarmTime[4]%60);   strcat(jO, tmp);
	sprintf(tmp, ",\n  \"offAlarmTime_fri\":\"%02d:%02d\"", _offAlarmTime[5]/60, _offAlarmTime[5]%60);   strcat(jO, tmp);
	sprintf(tmp, ",\n  \"offAlarmTime_sat\":\"%02d:%02d\"", _offAlarmTime[6]/60, _offAlarmTime[6]%60);   strcat(jO, tmp);
    strcat(jO,   ",\n  \"timeAnnouncing\":"); (_f_timeAnnouncement == true) ?                       strcat(jO, "\"true\"") : strcat(jO, "\"false\"");
    sprintf(tmp, ",\n  \"timeSpeechLang\":\"%s\"", _timeSpeechLang);                                strcat(jO, tmp);
    strcat(jO,   ",\n  \"mute\":");           (_f_mute == true)             ?                       strcat(jO, "\"true\"") : strcat(jO, "\"false\"");
	strcat(jO,   ",\n  \"fall_asleeps\":");           (fall_asleeps == true)             ?                       strcat(jO, "\"true\"") : strcat(jO, "\"false\"");
    sprintf(tmp, ",\n  \"brightness\":%i", _brightness);                                            strcat(jO, tmp);
	sprintf(tmp, ",\n  \"brightness2\":%i", _brightness2);                                            strcat(jO, tmp);
	sprintf(tmp, ",\n  \"_disptimer\":%i", _disptimer);                                            strcat(jO, tmp);
	sprintf(tmp, ",\n  \"_disptimer3\":%i", _disptimer3);                                            strcat(jO, tmp);
	strcat(jO,   ",\n  \"disptimer\":"); (disptimer == true) ?                                       strcat(jO, "\"true\"") : strcat(jO, "\"false\"");
    sprintf(tmp, ",\n  \"sleeptime\":%i", _sleeptime);                                              strcat(jO, tmp);
    sprintf(tmp, ",\n  \"lastconnectedhost\":\"%s\"", _settings.lastconnectedhost);                 strcat(jO, tmp);
    sprintf(tmp, ",\n  \"lastconnectedfile\":\"%s\"", _settings.lastconnectedfile);                 strcat(jO, tmp);
    sprintf(tmp, ",\n  \"station\":%i", _cur_station);                                              strcat(jO, tmp);
	sprintf(tmp, ",\n  \"Stationold1\":%i", Stationold1);                                              strcat(jO, tmp);
	sprintf(tmp, ",\n  \"Stationold2\":%i", Stationold2);                                              strcat(jO, tmp);
	sprintf(tmp, ",\n  \"Stationold3\":%i", Stationold3);                                              strcat(jO, tmp);
	sprintf(tmp, ",\n  \"Audiold1\":%i", Audiold1);                                              strcat(jO, tmp);
	sprintf(tmp, ",\n  \"Audiold2\":%i", Audiold2);                                              strcat(jO, tmp);
	sprintf(tmp, ",\n  \"Audiold3\":%i", Audiold3);                                              strcat(jO, tmp);
    sprintf(tmp, ",\n  \"Timezone_Name\":\"%s\"", _TZName.c_str());                                 strcat(jO, tmp);
    sprintf(tmp, ",\n  \"Timezone_String\":\"%s\"", _TZString.c_str());                             strcat(jO, tmp);
    sprintf(tmp, ",\n  \"toneLP\":%i", _toneLP);                                                    strcat(jO, tmp);
    sprintf(tmp, ",\n  \"toneBP\":%i", _toneBP);                                                    strcat(jO, tmp);
    sprintf(tmp, ",\n  \"toneHP\":%i", _toneHP);                                                    strcat(jO, tmp);
    sprintf(tmp, ",\n  \"balance\":%i", _toneBAL);                                                  strcat(jO, tmp);
    sprintf(tmp, ",\n  \"timeFormat\":%i", _timeFormat);                                            strcat(jO, tmp);
    sprintf(tmp, ",\n  \"state\":%i", _state);                                                      strcat(jO, tmp);
	sprintf(tmp, ",\n  \"state2\":%i", _state2);                                                      strcat(jO, tmp);
	sprintf(tmp, ",\n  \"state1\":%i", _state1);                                                      strcat(jO, tmp);
    sprintf(tmp, ",\n  \"sleepMode\":%i\n}", _sleepMode);                                           strcat(jO, tmp);

    if(_settingsHash != simpleHash(jO)) {
        File file = SD_MMC.open("/settings.json", "w", false);
        if(!file) {
            log_e("file \"settings.json\" not found");
            return;
        }
        file.print(jO);
        _settingsHash = simpleHash(jO);
    }
    x_ps_free(&jO);
}
// clang-format on

