serggggaae/ESP32-MiniWebRadio/main.cpp
exit:
    SerialPrintfln("Playlist:    " ANSI_ESC_BLUE "end of playlist");
    webSrv.send("SD_playFile=", "end of playlist");
    _f_playlistEnabled = false;
    _playerSubMenue = 0;
    changeState(PLAYER);
    _plsCurPos = 0;
    x_ps_free(&playFile);
    x_ps_free(&duration);
    x_ps_free(&title);
    x_ps_free(&plsContent);
    x_ps_free(&plsExtension);
    x_ps_free(&_playlistPath);
    return;
}
/*****************************************************************************************************************************************************
 *                                         C O N N E C T   TO   W I F I     /     A C C E S S P O I N T                                              *
 *****************************************************************************************************************************************************/
bool connectToWiFi() {

    char* line = x_ps_malloc(512);
    if(!line) { log_e("oom"); return false;}

    // create nvs entries if they do not exist
    if(!pref.isKey("wifiStr0")) pref.putString("wifiStr0", ""); // SSID + \t + PW
    if(!pref.isKey("wifiStr1")) pref.putString("wifiStr1", "");
    if(!pref.isKey("wifiStr2")) pref.putString("wifiStr2", "");
    if(!pref.isKey("wifiStr3")) pref.putString("wifiStr3", "");
    if(!pref.isKey("wifiStr4")) pref.putString("wifiStr4", "");
    if(!pref.isKey("wifiStr5")) pref.putString("wifiStr5", "");

    const char* SSID = _SSID;
    const char* PW = _PW;
    line[0] = '\0';
    strcpy(line, SSID); strcat(line, "\t"); strcat(line, PW);
    pref.putString("wifiStr0", line);

    for(int i = 0; i < 6; i++) {
        line[0] = '\0'; // Move this line outside the switch statement
        switch (i) {
            case 0: strcpy(line,pref.getString("wifiStr0").c_str()); break;
            case 1: strcpy(line,pref.getString("wifiStr1").c_str()); break;
            case 2: strcpy(line,pref.getString("wifiStr2").c_str()); break;
            case 3: strcpy(line,pref.getString("wifiStr3").c_str()); break;
            case 4: strcpy(line,pref.getString("wifiStr4").c_str()); break;
            case 5: strcpy(line,pref.getString("wifiStr5").c_str()); break;
        }
        if(strlen(line) < 5) continue;    // line is empty
        int pos = indexOf(line, "\t", 0); // find first tab
        if(pos < 0) continue;             // no tab found
        line[pos] = '\0';                 // terminate ssid
        char* ssid = line;                // ssid is the first part
        char* pw = line + pos + 1;        // password is the second part
        WiFi.mode(WIFI_STA);
        wifiMulti.addAP(ssid, pw); // SSID and PW in code"
        size_t offset = 0;
        size_t pwlen = strlen(pw);
        size_t dot_len = strlen(emoji.blueCircle); // = 4
        size_t buf_size = pwlen * dot_len + 1; // +1 für '\0'
        char pass[buf_size]; for(size_t j = 0; j < pwlen; j++) {memcpy(pass + offset, emoji.blueCircle, dot_len); offset += dot_len;}
        pass[offset] = '\0'; // Zero-terminate the string
        SerialPrintfln("WiFI_info:   add credentials: " ANSI_ESC_CYAN "%s - %s" ANSI_ESC_YELLOW " [%s:%d]", ssid, pass, __FILENAME__, __LINE__);
    }

    wifiMulti.setStrictMode(true);
    WiFi.mode(WIFI_STA);
    wifiMulti.run();
    if(WiFi.isConnected()) {
        SerialPrintfln("WiFI_info:   Connecting WiFi...");
        if(!MDNS.begin("MiniWebRadio")) { SerialPrintfln("WiFI_info:   " ANSI_ESC_YELLOW "Error starting mDNS"); }
        else {
           MDNS.addService("esp32", "tcp", 80);
           SerialPrintfln("WiFI_info:   mDNS name: " ANSI_ESC_CYAN "MiniWebRadio");
        }
        WiFi.setAutoReconnect(true);
        if(WIFI_TX_POWER >= 2 && WIFI_TX_POWER <= 21) WiFi.setTxPower((wifi_power_t)(WIFI_TX_POWER * 4));
        return true;
    }
    else {
        WiFi.mode(WIFI_MODE_NULL);
        SerialPrintfln("WiFI_info:   " ANSI_ESC_RED "WiFi credentials are not correct");
        return false; // can't connect to any network
    }
}
//——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
void setWiFiCredentials(const char* ssid, const char* password) {
    if(!ssid || !password) return;
    if(strlen(ssid) < 5) return; // min length

    log_e("ssid %s pw %s", ssid, password);

    char* line = x_ps_malloc(512);
    int i = 0, state = 0;
    if(!line) { log_e("oom"); goto exit; }

    for(i = 0; i < 6; i++) {
        line[0] = '\0'; // Move this line outside the switch statement
        switch (i) {
            case 0: strcpy(line,pref.getString("wifiStr0").c_str()); break;
            case 1: strcpy(line,pref.getString("wifiStr1").c_str()); break;
            case 2: strcpy(line,pref.getString("wifiStr2").c_str()); break;
            case 3: strcpy(line,pref.getString("wifiStr3").c_str()); break;
            case 4: strcpy(line,pref.getString("wifiStr4").c_str()); break;
            case 5: strcpy(line,pref.getString("wifiStr5").c_str()); break;
        }
        if(startsWith(line, ssid) && line[strlen(ssid)] == '\t') { // ssid found, update password
            line[0] = '\0'; // clear line
            strcat(line, ssid);
            strcat(line, "\t");
            strcat(line, password);
            if(i == 0) {log_e("password can't changed, is hard coded"); state = 0;goto exit;}
            if(i == 1) {pref.putString("wifiStr1", line); state = 1; goto exit;}
            if(i == 2) {pref.putString("wifiStr2", line); state = 1; goto exit;}
            if(i == 3) {pref.putString("wifiStr3", line); state = 1; goto exit;}
            if(i == 4) {pref.putString("wifiStr4", line); state = 1; goto exit;}
            if(i == 5) {pref.putString("wifiStr5", line); state = 1; goto exit;}
        }
    }
    for(i = 1; i < 6; i++) {
        line[0] = '\0';
        switch (i) {
            case 1: strcpy(line,pref.getString("wifiStr1").c_str()); break;
            case 2: strcpy(line,pref.getString("wifiStr2").c_str()); break;
            case 3: strcpy(line,pref.getString("wifiStr3").c_str()); break;
            case 4: strcpy(line,pref.getString("wifiStr4").c_str()); break;
            case 5: strcpy(line,pref.getString("wifiStr5").c_str()); break;
        }
        if(strlen(line) < 5) { // line is empty
            line[0] = '\0'; // clear line
            strcat(line, ssid);
            strcat(line, "\t");
            strcat(line, password);
            if(i == 1) {pref.putString("wifiStr1", line); state = 2; goto exit;}
            if(i == 2) {pref.putString("wifiStr2", line); state = 2; goto exit;}
            if(i == 3) {pref.putString("wifiStr3", line); state = 2; goto exit;}
            if(i == 4) {pref.putString("wifiStr4", line); state = 2; goto exit;}
            if(i == 5) {pref.putString("wifiStr5", line); state = 2; goto exit;}
        }
    }
    state = 3;

