serggggaae/ESP32-MiniWebRadio/main.cpp
    btn_BT_volDown.begin( 0 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_BT_volDown.setDefaultPicturePath("/btn/Button_Volume_Down_Blue.png");
                                                                                         btn_BT_volDown.setClickedPicturePath("/btn/Button_Volume_Down_Yellow.png");
    btn_BT_volUp.begin(   1 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_BT_volUp.setDefaultPicturePath("/btn/Button_Volume_Up_Blue.png");
                                                                                         btn_BT_volUp.setClickedPicturePath("/btn/Button_Volume_Up_Yellow.png");
    btn_BT_pause.begin(   2 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_BT_pause.setOffPicturePath("/btn/Button_Pause_Blue.png");
                                                                                         btn_BT_pause.setOnPicturePath("/btn/Button_Play_Blue.png");
                                                                                         btn_BT_pause.setClickedOffPicturePath("/btn/Button_Pause_Yellow.png");
                                                                                         btn_BT_pause.setClickedOnPicturePath("/btn/Button_Play_Yellow.png");
    btn_BT_mode.begin(    3 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_BT_mode.setDefaultPicturePath("/btn/Button_RxTx_Blue.png");
                                                                                         btn_BT_mode.setClickedPicturePath("/btn/Button_RxTx_Yellow.png");
    btn_BT_radio.begin(   4 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_BT_radio.setDefaultPicturePath("/btn/Button_Radio_Green.png");
                                                                                         btn_BT_radio.setClickedPicturePath("/btn/Button_Radio_Yellow.png");
    btn_BT_power.begin(   5 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_BT_power.setOffPicturePath("/btn/Button_Bluetooth_Red.png");
                                                                                         btn_BT_power.setOnPicturePath("/btn/Button_Bluetooth_Blue.png");
                                                                                         btn_BT_power.setClickedOffPicturePath("/btn/Button_Bluetooth_Yellow.png");
                                                                                         btn_BT_power.setClickedOnPicturePath("/btn/Button_Bluetooth_Yellow.png");
                                                                                         btn_BT_power.setValue(_f_BTpower);
                                                                                         pic_BT_mode.setPicturePath("/common/BTnc.png");
    pic_BT_mode.begin(        _winLogo.x,   _winLogo.y,   _winLogo.w,   _winLogo.h,   _winLogo.pl,   _winLogo.pr,   _winLogo.pt,   _winLogo.pb); pic_BT_mode.setAlternativPicturePath("/common/BTnc.png");
    txt_BT_volume.begin(      _winFileNr.x, _winFileNr.y, _winFileNr.w, _winFileNr.h, _winFileNr.pl, _winFileNr.pr, _winFileNr.pt, _winFileNr.pb); txt_BT_volume.setAlign(TFT_ALIGN_CENTER, TFT_ALIGN_CENTER); txt_BT_volume.setFont(_fonts[2]);
    txt_BT_mode.begin(        _winName.x,   _winName.y,   _winName.w,   _winName.h,   _winName.pl,   _winName.pr,   _winName.pt,   _winName.pb); txt_BT_mode.setAlign(TFT_ALIGN_CENTER, TFT_ALIGN_CENTER); txt_BT_mode.setFont(_fonts[5]);
    // IR_SETTINGS -------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
    btn_IR_radio.begin( 0 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);     btn_IR_radio.setDefaultPicturePath("/btn/Button_Radio_Green.png");
                                                                                         btn_IR_radio.setClickedPicturePath("/btn/Button_Radio_Yellow.png");
    // WIFI_SETTINGS -----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
    cls_wifiSettings.begin(_winWoHF.x, _winWoHF.y, _winWoHF.w, _winWoHF.h, _winWoHF.pl, _winWoHF.pr, _winWoHF.pt, _winWoHF.pb);
}
// clang-format off

/*         ╔═════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════╗
           ║                                                                              C H A N G E    S T A T E                                                                       ║
           ╚═════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════╝   */

// clang-format on
void changeState(int32_t state){
    disableAllObjects();
    _f_volBarVisible = false;
    if(_timeCounter.timer){setTimeCounter(0);}
    dispFooter.enable();
    dispHeader.enable();
    dispHeader.updateItem(_hl_item[state]);
    if(state != RADIO) {dispFooter.updateFlag(NULL);}
    switch(state) {
        case RADIO:{
            dispHeader.show(true);
            dispFooter.show(true);
            if(_state != RADIO) {clearWithOutHeaderFooter(); dispFooter.updateFlag(getFlagPath(_cur_station));}
            txt_RA_staName.enable();
            pic_RA_logo.enable();
            if(_radioSubMenue == 0){
                if(_f_irResultSeen){txt_RA_irNum.hide(); if(Stationold2 != _irResult) {Stationold3 = Stationold1; Stationold1 = _cur_station;} setStationByNumber(_irResult); _f_irResultSeen = false; if(Stationold1 != _cur_station) Stationold2 = _cur_station; brightallp();} // ir_number, valid between 1 ... 999
                if(_state != RADIO) {showLogoAndStationName(true);}
                setTimeCounter(0);
                VUmeter_RA.show(true);
                txt_RA_sTitle.setText("");
                txt_RA_sTitle.show(true, false);
                _f_newStreamTitle = true;
            }
            if(_radioSubMenue == 1){ // Mute, Vol+, Vol-, Sta+, Sta-, StaList
                clearTitle();
                txt_RA_sTitle.disable();
                sdr_RA_volume.show(true, false);
                btn_RA_mute.show();
                btn_RA_prevSta.show();   btn_RA_nextSta.show();
            //    txt_RA_staName.show(true, false);
                setTimeCounter(2);
            }
            if(_radioSubMenue == 2){ // Player, DLNA, Clock, SleepTime, Brightness, EQ, BT, Off
                btn_RA_staList.show();
                btn_RA_player.show();    btn_RA_dlna.show();  btn_RA_clock.show();
                btn_RA_sleep.show(); btn_RA_settings.show();
                btn_RA_bt.show(!_f_BtEmitterFound); btn_RA_off.show();
                setTimeCounter(2);
            }
            if(_radioSubMenue == 3){ // show Numbers from IR
                char buf[10];
                itoa(_irNumber, buf, 10);
                txt_RA_irNum.setText(buf);
                txt_RA_irNum.show(true, false);
                setTimeCounter(1);
            }
            if(_radioSubMenue == 4){ // IR select mode
                clearTitle();
                txt_RA_sTitle.disable();
                btn_RA_staList.show();
                btn_RA_player.show();
                btn_RA_dlna.show();
                btn_RA_clock.show();
                btn_RA_sleep.show();
                btn_RA_settings.show();
                btn_RA_bt.show(!_f_BtEmitterFound);
                btn_RA_off.show();
							if(btnNr > 7) btnNr = 3;
							if(btnNr == 0)btn_RA_staList.showAlternativePic();
                            if(btnNr == 1)btn_RA_player.showAlternativePic();
                            if(btnNr == 2)btn_RA_dlna.showAlternativePic();
                            if(btnNr == 3)btn_RA_clock.showAlternativePic();
                            if(btnNr == 4)btn_RA_sleep.showAlternativePic();
                            if(btnNr == 5)btn_RA_settings.showAlternativePic();
                            if(btnNr == 6)btn_RA_bt.showAlternativePic();
							if(btnNr == 7)btn_RA_off.showAlternativePic();
                setTimeCounter(2);
            }
            if(_state != RADIO) webSrv.send("changeState=", "RADIO");
            break;
        }

