serggggaae/ESP32-MiniWebRadio/main.cpp
        case STATIONSLIST:{
            dispHeader.show(false);
            dispFooter.show(false);
            clearWithOutHeaderFooter();
            lst_RADIO.show();
            setTimeCounter(LIST_TIMER);
            break;
        }

        case PLAYER: {
            dispHeader.show(true);
            dispFooter.show(true);
            if(_state != PLAYER) clearWithOutHeaderFooter();
            pic_PL_logo.enable();
            if(_playerSubMenue == 0){ // prev, next, ready, play_all, shuffle, list, radio, off
                if(!_cur_AudioFolder) {x_ps_free(&_cur_AudioFolder); _cur_AudioFolder = strdup("/audiofiles/");}
                _SD_content.listFilesInDir(_cur_AudioFolder, true, false);
                _cur_Codec = 0;
                showFileLogo(PLAYER);
                showFileName(_SD_content.getColouredSStringByIndex(_cur_AudioFileNr)); txt_PL_fName.show(true, false);
                pgb_PL_progress.hide();
                sdr_PL_volume.disable();
                if(_state != PLAYER) webSrv.send("changeState=", "PLAYER");
                txt_PL_fNumber.show(true, false);
                showAudioFileNumber();
                btn_PL_prevFile.show(); btn_PL_nextFile.show(); btn_PL_ready.show(); btn_PL_playAll.show(); btn_PL_shuffle.show(); btn_PL_fileList.show(); btn_PL_radio.show(); btn_PL_off.show();
            }
            if(_playerSubMenue == 1){
                btn_PL_fileList.hide();
                btn_PL_radio.hide();
                btn_PL_off.hide();
                pgb_PL_progress.setValue(0); pgb_PL_progress.show(true, false);
                sdr_PL_volume.show(true, false);
                showFileName(_SD_content.getColouredSStringByIndex(_cur_AudioFileNr)); txt_PL_fName.show(true, false);
                txt_PL_fNumber.show(true, false);
                btn_PL_mute.show();
				if(!audio.isRunning()) btn_PL_pause.setOn(); else btn_PL_pause.setOff();
                btn_PL_pause.show();
                btn_PL_cancel.show(); btn_PL_playPrev.show(); btn_PL_playNext.show();
            }
            if(_playerSubMenue == 2){ // same as submenue 0 for IR
                if(!_cur_AudioFolder) {_cur_AudioFolder = strdup("/audiofiles/"); _cur_AudioFileNr = 0;}
                _SD_content.listFilesInDir(_cur_AudioFolder, true, false);
                _cur_Codec = 0;
                showFileLogo(PLAYER);
                showFileName(_SD_content.getColouredSStringByIndex(_cur_AudioFileNr)); txt_PL_fName.show(true, false);
                pgb_PL_progress.hide();
                if(_state != PLAYER) webSrv.send("changeState=", "PLAYER");
                txt_PL_fNumber.show(true, false);
                showAudioFileNumber();
                btn_PL_prevFile.show(); btn_PL_nextFile.show(); btn_PL_ready.show(); btn_PL_playAll.show(); btn_PL_shuffle.show(); btn_PL_fileList.show(); btn_PL_radio.show(); btn_PL_off.show();
							if(btnNr > 7) btnNr = 3;
							if(btnNr == 0)btn_PL_prevFile.showAlternativePic();
                            if(btnNr == 1)btn_PL_nextFile.showAlternativePic();
                            if(btnNr == 2)btn_PL_ready.showAlternativePic();
                            if(btnNr == 3)btn_PL_playAll.showAlternativePic();
                            if(btnNr == 4)btn_PL_shuffle.showAlternativePic();
                            if(btnNr == 5)btn_PL_fileList.showAlternativePic();
                            if(btnNr == 6)btn_PL_radio.showAlternativePic();
							if(btnNr == 7)btn_PL_off.showAlternativePic();
            }
            if(_playerSubMenue == 3){ // same as submenue 1 for IR
                btn_PL_fileList.hide();
                btn_PL_radio.hide();
                btn_PL_off.hide();
                pgb_PL_progress.setValue(0); pgb_PL_progress.show(true, false);
                sdr_PL_volume.show(true, false);
                showFileName(_SD_content.getColouredSStringByIndex(_cur_AudioFileNr)); txt_PL_fName.show(true, false);
                txt_PL_fNumber.show(true, false);
				if(!audio.isRunning()) btn_PL_pause.setOn(); else btn_PL_pause.setOff();
                btn_PL_pause.show();
                btn_PL_cancel.show(); btn_PL_playPrev.show(); btn_PL_playNext.show();
							if(btnNr > 4) btnNr = 2;
							if(btnNr == 0)btn_PL_mute.showAlternativePic();
                            if(btnNr == 1)btn_PL_pause.showAlternativePic();
                            if(btnNr == 2)btn_PL_cancel.showAlternativePic();
                            if(btnNr == 3)btn_PL_playPrev.showAlternativePic();
                            if(btnNr == 4)btn_PL_playNext.showAlternativePic();
            }
            break;
        }
        case AUDIOFILESLIST: {
            dispHeader.show(false);
            dispFooter.show(false);
            clearWithOutHeaderFooter();
            lst_PLAYER.show(_cur_AudioFolder, _cur_AudioFileNr);
            setTimeCounter(LIST_TIMER);
            break;
        }
        case DLNA:{
            dispHeader.show(true);
            dispFooter.show(true);
            if(_state != DLNA){
                clearWithOutHeaderFooter();
                pic_DL_logo.enable();
                pgb_DL_progress.setValue(0);
                pgb_DL_progress.show(true, false);
                txt_DL_fName.show(true, false);
                showFileLogo(DLNA);
            }
            if(_dlnaSubMenue == 0){ // TP submenu
                if(audio.isRunning()) btn_DL_pause.setActive(true);
                else                  btn_DL_pause.setActive(false);
                btn_DL_pause.show(); sdr_DL_volume.show(true, false); btn_DL_mute.show(); btn_DL_cancel.show(); btn_DL_fileList.show(); btn_DL_radio.show();
            }
            if(_dlnaSubMenue == 1){ // IR submenu
                if(audio.isRunning()) btn_DL_pause.setActive(true);
                else                  btn_DL_pause.setActive(false);
                btn_DL_pause.show(); sdr_DL_volume.show(true, false); btn_DL_mute.show(); btn_DL_cancel.show(); btn_DL_fileList.show(); btn_DL_radio.show();
							if(btnNr > 4) btnNr = 2;
							if(btnNr == 0)btn_DL_mute.showAlternativePic();
                            if(btnNr == 1)btn_DL_pause.showAlternativePic();
                            if(btnNr == 2)btn_DL_cancel.showAlternativePic();
                            if(btnNr == 3)btn_DL_fileList.showAlternativePic();
                            if(btnNr == 4)btn_DL_radio.showAlternativePic();
            }
            if(_state != DLNA) webSrv.send("changeState=", "DLNA");
            break;
        }
        case DLNAITEMSLIST:{
            dispHeader.show(false);
            dispFooter.show(false);
            lst_DLNA.show(_currDLNAsrvNr, dlna.getServer(), dlna.getBrowseResult(), &_dlnaLevel, _dlnaMaxItems);
            setTimeCounter(LIST_TIMER);
            break;
        }
        case CLOCK:{
            dispHeader.show(false);
            dispFooter.show(false);
            if(_state != CLOCK) {bgColorWithOutHeaderFooter();}
            if(_timeFormat == 24) clk_CL_24.show();
            else                  clk_CL_12.show();
            if(_clockSubMenue == 0){
                btn_CL_mute.hide(); btn_CL_alarm.hide(); btn_CL_radio.hide(); sdr_CL_volume.disable(); btn_CL_off.hide();
            }
            if(_clockSubMenue == 1){
                setTimeCounter(2);
                btn_CL_mute.show();     btn_CL_alarm.show();    btn_CL_radio.show(); sdr_CL_volume.show(false, false); btn_CL_off.show();
            }
            if(_clockSubMenue == 2){ // same as _clockSubMenue 1 for IR
                setTimeCounter(2);
                btn_CL_alarm.show(); btn_CL_radio.show(); btn_CL_mute.show(); btn_CL_off.show(); sdr_CL_volume.show(false, false);
							if(btnNr > 3) btnNr = 1;
							if(btnNr == 0)btn_CL_alarm.showAlternativePic();
                            if(btnNr == 1)btn_CL_radio.showAlternativePic();
                            if(btnNr == 2)btn_CL_mute.showAlternativePic();
                            if(btnNr == 3)btn_CL_off.showAlternativePic();
            }
            break;
        }
        case ALARMCLOCK:{
            dispHeader.show(false);
            dispFooter.show(false);
            if(_state != ALARMCLOCK) bgColorWithOutHeaderFooter();
            if(_alarmSubMenue == 0){
                btn_AC_left.show(); btn_AC_right.show(); btn_AC_up.show(); btn_AC_down.show(); btn_AC_ready.show();
                clk_AC_red.show();
            }
            if(_alarmSubMenue == 1){ // same as _alarmSubMenue for IR
                setTimeCounter(2);
                btn_AC_left.show(); btn_AC_right.show(); btn_AC_up.show(); btn_AC_down.show(); btn_AC_ready.show();
                clk_AC_red.show();
							if(btnNr > 4) btnNr = 2;
							if(btnNr == 0)btn_AC_left.showAlternativePic();
                            if(btnNr == 1)btn_AC_right.showAlternativePic();
                            if(btnNr == 2)btn_AC_up.showAlternativePic();
                            if(btnNr == 3)btn_AC_down.showAlternativePic();
                            if(btnNr == 4)btn_AC_ready.showAlternativePic();
            }
            break;
        }
        case SLEEPTIMER:{
            dispHeader.show(true);
            dispFooter.show(true);
            if(_state != SLEEPTIMER) {
                clearWithOutHeaderFooter(); display_sleeptime();
                if(     TFT_CONTROLLER < 2) drawImage("/common/Night_Gown.bmp", 198, 23);
                else if(TFT_CONTROLLER < 7) drawImage("/common/Night_Gown.bmp", 280, 45);
                else                        drawImage("/common/Night_Gown.jpg", 482, 112);
            }
            if(_sleepTimerSubMenue == 0){
                btn_SL_up.show(); btn_SL_down.show(); btn_SL_ready.show(); btn_SL_cancel.show();
            }
            if(_sleepTimerSubMenue == 1){
                btn_SL_up.show(); btn_SL_down.show(); btn_SL_ready.show(); btn_SL_cancel.show();
							if(btnNr > 3) btnNr = 2;
							if(btnNr == 0)btn_SL_up.showAlternativePic();
                            if(btnNr == 1)btn_SL_down.showAlternativePic();
                            if(btnNr == 2)btn_SL_ready.showAlternativePic();
                            if(btnNr == 3)btn_SL_cancel.showAlternativePic();
            }
            break;
        }
        case SETTINGS:{
            dispHeader.show(true);
            dispFooter.show(true);
            if(_state != SETTINGS){
                clearWithOutHeaderFooter();
                showFileLogo(SETTINGS);
            }
            if(_settingsSubMenue == 0){
                btn_SE_bright.show(!_f_brightnessIsChangeable); btn_SE_equal.show(); btn_SE_wifi.show(); btn_SE_radio.show();
            }
            if(_settingsSubMenue == 1){
                btn_SE_bright.show(!_f_brightnessIsChangeable); btn_SE_equal.show(); btn_SE_wifi.show(); btn_SE_radio.show();
							if(btnNr > 3) btnNr = 1;
							if(btnNr == 0)btn_SE_bright.showAlternativePic();
                            if(btnNr == 1)btn_SE_equal.showAlternativePic();
                            if(btnNr == 2)btn_SE_wifi.showAlternativePic();
							if(btnNr == 3)btn_SE_radio.showAlternativePic();
            }
            break;
        }
        case BRIGHTNESS:{
            dispHeader.show(false);
            dispFooter.show(false);
            if(_state != BRIGHTNESS) {clearWithOutHeaderFooter(); pic_BR_logo.show(true, false);}
            sdr_BR_value.show(true, true);
            if(disptimer55) {txt_BR_value.setText(int2str(_brightness));} else {txt_BR_value.setText(int2str(_disptimer3));}
            txt_BR_value.show(true, true);
            if(_brightnessSubMenue == 0){
                btn_BR_ready.show();
            }
            if(_brightnessSubMenue == 1){ // same as _brightnessSubMenue for IR
                btn_BR_ready.showAlternativePic();
            }
            break;
        }
        case EQUALIZER:
        dispHeader.show(true);
        dispFooter.show(true);
            if(_state != EQUALIZER) clearWithOutHeaderFooter();
            sdr_EQ_lowPass.show(true, false); sdr_EQ_bandPass.show(true, false); sdr_EQ_highPass.show(true, false); sdr_EQ_balance.show(true, false);
            btn_EQ_lowPass.show(); btn_EQ_bandPass.show(); btn_EQ_highPass.show(); btn_EQ_balance.show(); btn_EQ_Player.show(); btn_EQ_mute.show();
            txt_EQ_lowPass.show(true, false); txt_EQ_bandPass.show(true, false); txt_EQ_highPass.show(true,  false); txt_EQ_balance.show(true, false);
            if(_equalizerSubMenue == 0){
                btn_EQ_Radio.show();
            }
            if(_equalizerSubMenue == 1){
				btn_EQ_Radio.show();
							if(btnNr < 10) btnNr = btnNr2;
                            if(btnNr == 10)btn_EQ_balance.showAlternativePic();
                            if(btnNr == 20)btn_EQ_lowPass.showAlternativePic();
							if(btnNr == 30)btn_EQ_bandPass.showAlternativePic();
							if(btnNr == 40)btn_EQ_highPass.showAlternativePic();
							if(btnNr == 0)btn_EQ_Radio.showAlternativePic();
							if(btnNr == 1)btn_EQ_Player.showAlternativePic();
							if(btnNr == 2)btn_EQ_mute.showAlternativePic();
							
