serggggaae/ESP32-MiniWebRadio/main.cpp
            }

            break;

        case BLUETOOTH: {
            dispHeader.show(true);
            dispFooter.show(true);
			if(!_f_BTpower) muteChanged(false);
            clearWithOutHeaderFooter();
            btn_BT_volUp.show(); btn_BT_volDown.show(); btn_BT_pause.show(); btn_BT_mode.show(); btn_BT_radio.show(); btn_BT_power.show(); pic_BT_mode.show(true, false);
            char* mode = strdup(bt_emitter.getMode());
            if(strcmp(mode, "RX") == 0){
                txt_BT_mode.writeText("RECEIVER");
                if(bt_emitter.isConnected()) muteChanged(true);
            }
            else {
                txt_BT_mode.writeText("EMITTER"); muteChanged(false);
            }
            txt_BT_mode.setBGcolor(TFT_BROWN); txt_BT_mode.show(true, false);
            char c[10]; sprintf(c, "Vol: %02i", bt_emitter.getVolume()); txt_BT_volume.writeText(c); txt_BT_volume.show(true, false);
            if(_state != BLUETOOTH) webSrv.send("changeState=", "BLUETOOTH");
            x_ps_free(&mode);
            break;
        }
        case IR_SETTINGS:
            dispHeader.show(true);
            dispFooter.show(true);
            clearWithOutHeaderFooter();
            btn_IR_radio.show();
            break;

        case RINGING:
            dispHeader.show(true);
            dispFooter.show(true);
            clearWithOutHeaderFooter();
            if(_ringVolume > 0){ // alarm with bell
                pic_RI_logo.enable();
                showFileLogo(RINGING);
                brightallp();
                SerialPrintfln(ANSI_ESC_MAGENTA "Alarm");
                setVolume(_ringVolume);
                audio.setVolume(_ringVolume, _volumeCurve);
                muteChanged(false);
                connecttoFS("SD_MMC", "/ring/alarm_clock.mp3");
                clk_RI_24small.show();
            }
            else{ // alarm without bell
                _f_eof_alarm = true;
            }
            break;

        case WIFI_SETTINGS:
            dispHeader.show(true);
            dispFooter.show(true);
            clearWithOutHeaderFooter();
            cls_wifiSettings.clearText();
            cls_wifiSettings.setBorderWidth(1);
            cls_wifiSettings.setFontSize(_listFontSize);
            int16_t n = WiFi.scanNetworks();
            SerialPrintfln("setup: ....  " ANSI_ESC_WHITE "%i WiFi networks found", n);
            for(int i = 0; i < n; i++){
                SerialPrintfln("setup: ....  " ANSI_ESC_GREEN "%s (%d)", WiFi.SSID(i).c_str(), (int16_t)WiFi.RSSI(i));
                const char* pw = getWiFiPW(WiFi.SSID(i).c_str());
                // if(pw){log_e("found password %s for %s", pw, WiFi.SSID(i).c_str());}
                // else  {log_e("no password found for %s", WiFi.SSID(i).c_str());}
                cls_wifiSettings.addWiFiItems(WiFi.SSID(i).c_str(), pw);
            }
            cls_wifiSettings.show(false, false);
            break;
    }
    _state = state;
}
// clang-format on

const char* getWiFiPW(const char* ssid){
    static char* line = NULL;
    if(line) x_ps_free(&line);
    line = (char*)x_ps_malloc(128);

    static char* password = NULL;
    if(line) x_ps_free(&password);
    password = (char*)x_ps_malloc(128);
    if(!password) { log_e("oom"); return NULL;}

    for(int j = 0; j < 6; j++){
        if(j == 0) strcpy(line, pref.getString("wifiStr0").c_str());
        if(j == 1) strcpy(line, pref.getString("wifiStr1").c_str());
        if(j == 2) strcpy(line, pref.getString("wifiStr2").c_str());
        if(j == 3) strcpy(line, pref.getString("wifiStr3").c_str());
        if(j == 4) strcpy(line, pref.getString("wifiStr4").c_str());
        if(j == 5) strcpy(line, pref.getString("wifiStr5").c_str());
        if(startsWith(line, ssid) && line[strlen(ssid)] == '\t') {
            if(indexOf(line, "\t", 0) > 0) {
                int idx = indexOf(line, "\t", 0);
                strcpy(password, line + idx + 1);
                // SerialPrintfln("WiFi: .....  " ANSI_ESC_GREEN "SSID '%s', PW '%s'", ssid, password);
                return password;
            }
            else {
                // SerialPrintfln("WiFi: .....  " ANSI_ESC_GREEN "SSID '%s', PW '%s'", ssid, "is not set");
                return NULL;
            }
        }
    }
    return NULL;
}

bool setWiFiPW(const char* ssid, const char* password){
    if(!ssid || !password) return NULL;
    static char* line = NULL;
    if(line) x_ps_free(&line);
    line = (char*)x_ps_malloc(512);
    if(!line) { log_e("oom"); return NULL;}
    strcpy(line, ssid);
    strcat(line, "\t");
    strcat(line, password);

    for(int j = 1; j < 6; j++){
        if(j == 1) strcpy(line, pref.getString("wifiStr1").c_str());
        if(j == 2) strcpy(line, pref.getString("wifiStr2").c_str());
        if(j == 3) strcpy(line, pref.getString("wifiStr3").c_str());
        if(j == 4) strcpy(line, pref.getString("wifiStr4").c_str());
        if(j == 5) strcpy(line, pref.getString("wifiStr5").c_str());
        if(startsWith(line, ssid) && line[strlen(ssid)] == '\t') {
            switch(j){
                case 1: pref.putString("wifiStr1", line); break;
                case 2: pref.putString("wifiStr2", line); break;
                case 3: pref.putString("wifiStr3", line); break;
                case 4: pref.putString("wifiStr4", line); break;
                case 5: pref.putString("wifiStr5", line); break;
            }
            SerialPrintfln("WiFi: .....  " ANSI_ESC_GREEN "save new PW for SSID %s,  %s", ssid, line);
            return true;
        }
    }
    for(int j = 0; j < 6; j++){
        if(j == 0) strcpy(line, pref.getString("wifiStr0").c_str());
        if(j == 1) strcpy(line, pref.getString("wifiStr1").c_str());
        if(j == 2) strcpy(line, pref.getString("wifiStr2").c_str());
        if(j == 3) strcpy(line, pref.getString("wifiStr3").c_str());
        if(j == 4) strcpy(line, pref.getString("wifiStr4").c_str());
        if(j == 5) strcpy(line, pref.getString("wifiStr5").c_str());
        if(strcmp(line, "\t") == 0) {
            switch(j){
                case 0: pref.putString("wifiStr0", line); break;
                case 1: pref.putString("wifiStr1", line); break;
                case 2: pref.putString("wifiStr2", line); break;
                case 3: pref.putString("wifiStr3", line); break;
                case 4: pref.putString("wifiStr4", line); break;
                case 5: pref.putString("wifiStr5", line); break;
            }
            SerialPrintfln("WiFi: .....  " ANSI_ESC_GREEN "save new SSID and PW %s,  %s", ssid, line);
            return true;
        }
    }
    SerialPrintfln("WiFi: .....  " ANSI_ESC_RED "no free space for new SSID and PW %s,  %s", ssid, line);
    x_ps_free(&line);
    return false;
}




/*         ╔═════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════╗
           ║                                                                                    L O O P                                                                                  ║
           ╚═════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════╝   */

void loop() {
    if(!_f_ESPfound)    {vTaskDelay(10);return;}    // Guard:  wrong chip?
    if(!_f_SD_MMCfound) {vTaskDelay(10); return;}   // Guard:  SD_MMC could not be initialisized

