serggggaae/ESP32-MiniWebRadio/main.cpp
    vTaskDelay(1);
    audio.loop();
    webSrv.loop();
    ir.loop();
    tp.loop();
    ftpSrv.handleFTP();
    ArduinoOTA.handle();
    dlna.loop();
    bt_emitter.loop();
    tft.loop();

    if(_f_dlnaBrowseServer) {_f_dlnaBrowseServer = false; dlna.browseServer(_currDLNAsrvNr, _dlnaHistory[_dlnaLevel].objId, _totalNumberReturned);}
    if(_f_clearLogo)        {_f_clearLogo = false; clearLogo();}
    if(_f_clearStationName) { _f_clearStationName = false; clearStationName();}

    if(_f_playlistEnabled) {
        if(!_f_playlistNextFile) {
            if(!audio.isRunning() && !_f_pauseResume) {
                SerialPrintfln("AUDIO_info:  " ANSI_ESC_GREEN "next playlist file");
                processPlaylist(false);
                _playlistTime = millis();
                _f_playlistNextFile = true;
            }
        }
        else {
            if(_playlistTime + 5000 < millis()) _f_playlistNextFile = false;
        }
    }
    //-----------------------------------------------------0.1 SEC------------------------------------------------------------------------------------
    if(_f_100ms) { // calls every 0.1 second
        _f_100ms = false;

        if(_state == RADIO && _radioSubMenue == 0) VUmeter_RA.update(audio.getVUlevel());

        static uint8_t factor = 0;
        static bool f_tc = false;
        if(factor > 0){
            factor --;
        }
        else{
            if(_timeCounter.timer > 0){
                factor = _timeCounter.factor;
                dispFooter.updateTC(_timeCounter.timer);
                _timeCounter.timer --;
                f_tc = true;
            }
            else{
                if(f_tc){
                    f_tc = false;
                    dispFooter.updateTC(0);
                    if(_f_sleeping) return; // tc is active by pressing a button, but do nothing if "off"

                    if(_state == RADIO) {
                                            if(!txt_RA_staName.isEnabled()){  txt_RA_staName.show(true, false); }// assume volBox is shown
                                            if(_radioSubMenue == 1) { _radioSubMenue = 0; changeState(RADIO);} // Mute, Vol+, Vol-, Sta+, Sta-, StaList
                                            if(_radioSubMenue == 2) { _radioSubMenue = 0; changeState(RADIO);} // Player, DLNA, Clock, SleepTime, Brightness, EQ, BT, Off
                                            if(_radioSubMenue == 3) { _radioSubMenue = 0; changeState(RADIO);} // show Numbers from IR
                                            if(_radioSubMenue == 4) { _radioSubMenue = 0; changeState(RADIO);} // IR select mode
                    }
                    else if(_state == STATIONSLIST) {
                                            _radioSubMenue = 0; changeState(RADIO);
                    }
                    else if(_state == PLAYER){
                                            if(!txt_PL_fName.isEnabled()){txt_PL_fName.show(true, false);} // assume volBox is shown
                                            if(_playerSubMenue == 2) {_playerSubMenue = 0; changeState(PLAYER);}
                                            if(_playerSubMenue == 3){ _playerSubMenue = 1; changeState(PLAYER);}
                    }
                    else if(_state == AUDIOFILESLIST) {
                                            _playerSubMenue = 0; changeState(PLAYER);
                    }
                    else if(_state == DLNA) {
                                            if(!txt_DL_fName.isEnabled()){ txt_DL_fName.show(true, false);} // assume volBox is shown
                                            if(_dlnaSubMenue == 1) {_dlnaSubMenue = 0; changeState(DLNA);}
                    }
                    else if(_state == DLNAITEMSLIST) {
                                            _dlnaSubMenue = 0;       changeState(DLNA);
                    }
                    else if(_state == CLOCK){
                                            _clockSubMenue = 0;      changeState(CLOCK);
                    }
                    else if(_state == ALARMCLOCK){
                                            _alarmSubMenue = 0;      changeState(ALARMCLOCK);
                    }
                    else if(_state == SETTINGS){
                                            _settingsSubMenue = 0;   changeState(SETTINGS);
                    }
                    else if(_state == BRIGHTNESS){
                                            _brightnessSubMenue = 0; changeState(BRIGHTNESS);
                    }
                    else if(_state == EQUALIZER){
                                            _equalizerSubMenue = 0;  changeState(EQUALIZER);
                    }
                    else { ; } // all other, do nothing
                }
            }
        }

        if(!_f_rtc) {
            _f_rtc = rtc.hasValidTime();
        }

        int16_t audioVol = audio.getVolume();
        //------------------------------------------------------------------------
        if(AMP_ENABLED >= 0){                // An external amplifier can be switched, if a GPIO has been assigned.
            static bool av = false;          // The amplifier switches off when the real volume (not _cur_volume) reaches the value 0.
            if((audioVol > 0) != av){        // This is also the case in sleep mode.
                av = (audioVol > 0);
                digitalWrite(AMP_ENABLED, av);
                if(av)  {SerialPrintfln("Amplifier:   " ANSI_ESC_YELLOW "The external amplifier was activated");}
                else    {SerialPrintfln("Amplifier:   " ANSI_ESC_YELLOW "The external amplifier was deactivated");}
            }
        }
        //------------------------------------------------------------------------
        uint8_t currVol = _cur_volume;
        if(_f_mute) currVol = 0;
        uint8_t steps = _volumeSteps / 7;
        if (audioVol > currVol){ // downvolume
            if(audioVol - steps >= currVol ) {if(audioVol - steps <   0) audio.setVolume(0, _volumeCurve);   else  audio.setVolume(audioVol- steps, _volumeCurve);}
            else audio.setVolume(audioVol - 1, _volumeCurve);
        }
        if (audioVol < currVol){ // upvolume
            if(audioVol + steps <= currVol) {if(audioVol + steps > 255) audio.setVolume(255, _volumeCurve); else audio.setVolume(audioVol + steps, _volumeCurve);}
            else {audio.setVolume(audioVol + 1, _volumeCurve);}
        }

