serggggaae/ESP32-MiniWebRadio/main.cpp
    }
    //-----------------------------------------------------1 SEC--------------------------------------------------------------------------------------

    if(_f_1sec) { // calls every second
        _f_1sec = false;
        _totalRuntime++;
        uint16_t minuteOfTheDay = rtc.getMinuteOfTheDay();
        uint8_t  weekDay = rtc.getweekday();
        if(_timeFormat == 24) clk_CL_24.updateTime(minuteOfTheDay, weekDay);
        else                  clk_CL_12.updateTime(minuteOfTheDay, weekDay);
        if(_state == RINGING) clk_RI_24small.updateTime(minuteOfTheDay, weekDay);
        static uint8_t semaphore = 0;
        if(!semaphore) {_f_alarm = isAlarm(weekDay, _alarmdays, minuteOfTheDay, _alarmtime) && _f_rtc;} // alarm if rtc and CL green
		if(!semaphore) {_f_offAlarm = isAlarm(weekDay, _offAlarmDays, minuteOfTheDay, _offAlarmTime) && _f_rtc;} // alarm if rtc and CL green
        if(_f_alarm || _f_offAlarm)        {semaphore++;}
        if(semaphore)       {semaphore++;}
        if(semaphore >= 65) {semaphore = 0;}

        //------------------------------------------ALARMCLOCK MANAGEMENT----------------------------------------------------------------------------------
		if(_f_offAlarm){
		_f_offAlarm = false;
		_f_irOnOff = true;
		fall_asleep();}
        if(_f_alarm) {
            _f_alarm = false;
            changeState(RINGING);
        }
        if(_f_eof_alarm) { // AFTER RINGING
            _f_eof_alarm = false;
            if(!_f_rtc) return;
            _cur_volume = _volumeAfterAlarm;
            setVolume(_cur_volume);
            audio.setVolume(_cur_volume, _volumeCurve);
            dispHeader.updateVolume(_cur_volume);
            wake_up();
        }

        if(_f_stationsChanged) {
            _f_stationsChanged = false;
            staMgnt.updateStationsList();
        }

        //------------------------------------------UPDATE DISPLAY------------------------------------------------------------------------------------
        if(!_f_sleeping || _state == RINGING) {
            dispHeader.updateTime(_time_s, false);
            dispHeader.updateRSSI(WiFi.RSSI());

            if(_f_newBitRate) {
               _f_newBitRate = false;
               dispFooter.updateBitRate(_icyBitRate);
            }
            if(_f_newStationName) {
                _f_newStationName = false;
                showLogoAndStationName(false);
            }
        }
        //---------------------------------------------TIME SPEECH -----------------------------------------------------------------------------------
        static bool f_resume = false;
        if(_f_timeSpeech){ // speech the time 7 sec before a new hour is arrived
            _f_timeSpeech =  false;
            int hour = atoi(_time_s); hour++; if(hour == 24) hour = 0; //  extract the hour
            if(_f_mute) return;
            if(_f_sleeping) return;
            if(_state != RADIO) return;
            if(_f_timeAnnouncement) {
                f_resume = true;
                _f_eof = false;
                if(_timeFormat == 12) {if(hour > 12) hour -= 12;}
                sprintf(_chbuf, "/voice_time/%s/%d_00.mp3", _timeSpeechLang, hour);
                SerialPrintfln("Time: ...... play Audiofile %s", _chbuf) connecttoFS("SD_MMC", _chbuf);
                return;
            }
            else { SerialPrintfln("Time: ...... Announcement at %d o'clock is silent", hour); }
        }
        if(f_resume && _f_eof){
            f_resume = false;
            _f_eof = false;
            if(_cur_station) setStation(_cur_station);
            else connecttohost(_settings.lastconnectedhost);
            return;
        }
        //------------------------------------------AUDIO_CURRENT_TIME - DURATION---------------------------------------------------------------------
        if(audio.isRunning()){
            _audioFileDuration = audio.getAudioFileDuration();
            if(_audioFileDuration > 0){
                _audioCurrentTime = audio.getAudioCurrentTime();
                if(_state == PLAYER && _audioFileDuration){pgb_PL_progress.setNewMinMaxVal(0, _audioFileDuration); pgb_PL_progress.setValue(_audioCurrentTime);}
                if(_state == DLNA &&   _audioFileDuration){pgb_DL_progress.setNewMinMaxVal(0, _audioFileDuration); pgb_DL_progress.setValue(_audioCurrentTime);}
                if(_audioFileDuration) {
                    SerialPrintfcr("AUDIO_FILE:  " ANSI_ESC_GREEN "AudioCurrentTime " ANSI_ESC_GREEN "%li:%02lis, " ANSI_ESC_GREEN "AudioFileDuration " ANSI_ESC_GREEN "%li:%02lis",
                                   (long int)_audioCurrentTime / 60, (long int)_audioCurrentTime % 60, (long int)_audioFileDuration / 60, (long int)_audioFileDuration % 60);
                }
            }
        }
        //------------------------------------------NEW STREAMTITLE-----------------------------------------------------------------------------------
        if(_f_newStreamTitle && !_timeCounter.timer) {
            _f_newStreamTitle = false;
            if(_state == RADIO) {
                if(strlen(_streamTitle)) showStreamTitle(_streamTitle);
                else if(strlen(_icyDescription)) {
                    showStreamTitle(_icyDescription);
                    _f_newIcyDescription = false;
                    webSrv.send("icy_description=", _icyDescription);
                }
                else txt_RA_sTitle.writeText("");
            }
            webSrv.send("streamtitle=", _streamTitle);
        }
        //------------------------------------------NEW ICY-DESCRIPTION-------------------------------------------------------------------------------
        if(_f_newIcyDescription && !_timeCounter.timer) {
            if(_state == RADIO) {
                if(!strlen(_streamTitle)) showStreamTitle(_icyDescription);
            }
            webSrv.send("icy_description=", _icyDescription);
            _f_newIcyDescription = false;
        }
        //------------------------------------------NEW COMMERCIALS-----------------------------------------------------------------------------------
        if(_f_newCommercial && !_timeCounter.timer) {
            if(_state == RADIO) { showStreamTitle(_commercial); }
            webSrv.send("streamtitle=", _commercial);
            _f_newCommercial = false;
        }
        //------------------------------------------END OF COMMERCIALS--------------------------------------------------------------------------------
        if(_commercial_dur > 0) {
            _commercial_dur--;
            if((_commercial_dur == 2) && (_state == RADIO)) /* showStreamTitle(""); */ _f_newStreamTitle = true; // end of commercial? clear streamtitle
        }
        //------------------------------------------DETERMINE AUDIOCODEC------------------------------------------------------------------------------
        if(_cur_Codec == 0) {
            uint8_t c = audio.getCodec();
            if(c != 0 && c != 8 && c < 10) { // unknown or OGG, guard: c {1 ... 7, 9}
                _cur_Codec = c;
                SerialPrintfln("Audiocodec:  " ANSI_ESC_YELLOW "%s", codecname[c]);
                if(_state == PLAYER) showFileLogo(PLAYER);
                if(_state == RADIO && _f_logoUnknown == true) {
                    _f_logoUnknown = false;
                    showFileLogo(_state);
                }
            }
        }
        //------------------------------------------CONNECT TO LASTHOST-------------------------------------------------------------------------------
        if(_f_connectToLastStation){ // not used yet
            _f_connectToLastStation = false;
            if(_cur_station) setStation(_cur_station);
            else connecttohost(_settings.lastconnectedhost);
        }
        //------------------------------------------RECONNECT AFTER FAIL------------------------------------------------------------------------------
        if(_f_reconnect && !_f_WiFiConnected){
            _f_reconnect = false;
            connecttohost(_settings.lastconnectedhost);
        }
        //------------------------------------------SEEK DLNA SERVER----------------------------------------------------------------------------------
        if(_f_dlnaSeekServer) {
            _f_dlnaSeekServer = false;
            dlna.seekServer();
        }
        //------------------------------------------CREATE DLNA PLAYLIST------------------------------------------------------------------------------
        if(_f_dlnaMakePlaylistOTF && _f_dlna_browseReady){
            _f_dlnaMakePlaylistOTF = false;
            _f_dlna_browseReady = false;
            if(preparePlaylistFromDLNAFolder()) processPlaylist(true);
        }
        //------------------------------------------DLNA ITEMS RECEIVED-------------------------------------------------------------------------------
        if(_f_dlna_browseReady){ // unused
            _f_dlna_browseReady = false;
        }
        //-------------------------------------------WIFI DISCONNECTED?-------------------------------------------------------------------------------
        if(_f_WiFiConnected){
            if((WiFi.status() != WL_CONNECTED)) {
                _WiFi_disconnectCnt ++;
                if(_WiFi_disconnectCnt == 15){
                    _WiFi_disconnectCnt = 1;
                    SerialPrintfln("WiFi      :  " ANSI_ESC_YELLOW "Reconnecting to WiFi...");
                    WiFi.disconnect();
                    WiFi.reconnect();
                }
            }
            else{
                if(_WiFi_disconnectCnt){
                    _WiFi_disconnectCnt = 0;
                    if(_state == RADIO) audio.connecttohost(_settings.lastconnectedhost);
                }
            }
        }
        //------------------------------------------CONNECTTOHOST FAIL--------------------------------------------------------------------------------
        static uint8_t failCnt = 0;
        if(_f_webFailed){
            failCnt++;
            if(failCnt == 30){
                failCnt = 0;
                if(WiFi.isConnected()) connecttohost(_settings.lastconnectedhost);
                else ESP.restart();
            }
        }
        else failCnt = 0;
        //------------------------------------------GET AUDIO FILE ITEMS------------------------------------------------------------------------------
        if(_f_isFSConnected) {
            //    uint32_t t = 0;
            //    uint32_t fs = audioGetFileSize();
            //    uint32_t br = audioGetBitRate();
            //    if(br) t = (fs * 8)/ br;
            //    log_w("Br %d, Dur %ds", br, t);
        }
        //--------------------------------------AMBIENT LIGHT SENSOR BH1750---------------------------------------------------------------------------
        if(_f_BH1750_found){
		    int32_t ambVal = BH1750.getBrightness() * _brightness2;
			if(ambVal > 350) ambVal = 350;
            _bh1750Value = map_l(ambVal, 0, 350, 0, 100);
			if(_bh1750Value >= _brightness) current_brightness = _bh1750Value;
			else current_brightness = _brightness;
			if(!_f_sleeping && !dispOff && _f_BH1750_found){
            if(_bh1750Value >= _brightness) setTFTbrightness(_bh1750Value);
            else setTFTbrightness(_brightness);}
			BH1750.start();}
} //  END _f_1sec


    if(_f_10sec == true) { // calls every 10 seconds
        _f_10sec = false;
        if(_state == RADIO && !_icyBitRate && !_f_sleeping) {
            _decoderBitRate = audio.getBitRate();
            static uint32_t oldBr = 0;
            if(_decoderBitRate != oldBr){
                oldBr = _decoderBitRate;
                dispFooter.updateBitRate(_decoderBitRate / 1000);
            }
        }
        updateSettings();
    }

    if(_f_1min == true) {  // calls every minute
        _f_1min = false;
        if(_sleeptime){
            _sleeptime--;
            if(!_sleeptime) fall_asleep();
            dispFooter.updateOffTime(_sleeptime);
        }
	if(disptimer && _state != STATIONSLIST && _state != AUDIOFILESLIST && _state != DLNAITEMSLIST) {if(_disptimer2 > 0) {_disptimer2 --; if(!_disptimer2) brightallm();}}
		
