serggggaae/ESP32-MiniWebRadio/main.cpp
        static uint8_t btEmitterCnt = 0;
        if(!_f_BtEmitterFound && btEmitterCnt < 1){
            btEmitterCnt++;
            bt_emitter.begin(); // if the emitter has not yet responded
        }
    }

    //-------------------------------------------------DEBUG / WIFI_SETTINGS ----------------------------------------------------------------------------------
    if(Serial.available()) { // input: serial terminal
        String r = Serial.readString();
        r.replace("\n", "");
        SerialPrintfln("Terminal  :  " ANSI_ESC_YELLOW "%s", r.c_str());
        if(r.startsWith("pr")) {
            _f_pauseResume = audio.pauseResume();
            if(_f_pauseResume) { SerialPrintfln("Terminal   : " ANSI_ESC_YELLOW "Pause-Resume"); }
            else { SerialPrintfln("Terminal   : " ANSI_ESC_YELLOW "Pause-Resume not possible"); }
        }
        if(r.startsWith("hc")) { // A hardcopy of the display is created and written to the SD card
            { SerialPrintfln("Terminal   : " ANSI_ESC_YELLOW "create hardcopy"); }
            hardcopy();
        }
        if(r.startsWith("rts")) {
            char* timeStatsBuffer = x_ps_calloc(2000, sizeof(char));
            GetRunTimeStats(timeStatsBuffer);
            { SerialPrintfln("Terminal   : " ANSI_ESC_YELLOW "task statistics\n\n%s", timeStatsBuffer); }
            x_ps_free(&timeStatsBuffer);
        }
        if(r.startsWith("cts")) {
            audio.connecttospeech("Hallo, wie geht es dir? Morgen scheint die Sonne und übermorgen regnet es.Aber wir nehmen den Regenschirm mit. Und auch den Rucksack. Dann lesen wir aus dem Buch Hier gibt es nur gutes Wetter.", "de");
        //    audio.connecttospeech("Hallo", "de");
        }

        if(r.toInt() != 0) { // is integer?
            if(audio.setTimeOffset(r.toInt())) { SerialPrintfln("Terminal   : " ANSI_ESC_YELLOW "TimeOffset %li", r.toInt()); }
            else { SerialPrintfln("Terminal   : " ANSI_ESC_YELLOW "TimeOffset not possible"); }
        }
        if(r.startsWith("bfi")){ // buffer filled
            SerialPrintfln("inBuffer  :  filled %lu bytes", (long unsigned)audio.inBufferFilled());
            SerialPrintfln("inBuffer  :  free   %lu bytes", (long unsigned)audio.inBufferFree());
        }
        if(r.startsWith("st")){ // testtext for streamtitle
            if(r[2] == '0') strcpy(_streamTitle, "A Ё Ю");
            if(r[2] == '1') strcpy(_streamTitle, "A B C D E F G");
            if(r[2] == '2') strcpy(_streamTitle, "A B C D E F G H I");
            if(r[2] == '3') strcpy(_streamTitle, "A B C D E F G H I J K L");
            if(r[2] == '4') strcpy(_streamTitle, "A B C D E F G H I J K J M Q O");
            if(r[2] == '5') strcpy(_streamTitle, "A B C D E F G H I K L J M y O P Q R");
            if(r[2] == '6') strcpy(_streamTitle, "A B C D E F G H I K L J M g O P Q R S T V A B C D E F G H I K L J M p O P Q R S T U V W K J Q p O P Q R S T U V W K J Q A B C D E F G H I K L J M p O P Q R S T U V W K J Q p O P Q R S T U V W K J Q V A B C D E F G H I K L J M p O P Q R S T U V W K J Q p O P Q R S T U V W K J Q A B C D E F G H I K L J M p O P Q R S T U V W K J Q p O P Q R S T U V W K J Q");
            if(r[2] == '7') strcpy(_streamTitle, "A B C D E F G H I K L J M j O P Q R S T U V A B C D E F G H I K L J M p O P Q R S T U V W K J Q p O P Q R S T U V W K J Q A B C D E F G H I K L J M p O P Q R S T U V W K J Q p O P Q R S T U V W K J Q");
            if(r[2] == '8') strcpy(_streamTitle, "A B C D E F G H I K L J M p O P Q R S T U V W A B C D E F G H I K L J M p O P Q R S T U V W K J Q p O P Q R S T U V W K J Q");
            if(r[2] == '9') strcpy(_streamTitle, "A B C D E F G H I K L J M p O P Q R S T U V W K J Q p O P Q R S T U V W K J Q");
            log_w("st: %s", _streamTitle);
            _f_newStreamTitle = true;
        }
        if(r.startsWith("ais")){ // openAIspeech
            log_w("openAI speech");
        //    audio.openai_speech("openAI-key", "tts-1", "Today is a wonderful day to build something people love!", "", "shimer", "mp3", "1");
        }
        // if(r.startsWith("ctfs")){ // connecttoFS
        //     log_w("SPIFFS");
        //     connecttoFS("SPIFFS", "/Collide.ogg");
        // }

        if(r.startsWith("sfp")){ // setFilePosition
            uint32_t pos = r.substring(4, r.length() -1).toInt();
            log_w("setFilePosition %lu", pos);
            audio.setFilePos(pos);
        }

        if(r.startsWith("sapp")){ // setAudioPlayPosition
            uint32_t pos = r.substring(4, r.length() -1).toInt();
            log_w("setAudioPlayPosition %lu", pos);
            audio.setAudioPlayPosition(pos);
        }

        if(r.startsWith("grn")){ // list of all self registered objects
            get_registered_names();
        }
        if(r.startsWith("fm")){ // force mono
            static bool f_mono = false;
            f_mono = !f_mono;
            audio.forceMono(f_mono);
            f_mono? log_w("mono"): log_w("stereo");
        }
        if(r.startsWith("btp")){ // bluetooth RX/TX protocol
            uint16_t i = 0;
            while(bt_emitter.list_protokol(i)){
                log_e("%s", bt_emitter.list_protokol(i));
                i++;
            }
        }
        if(r.startsWith("btstr")){ // bluetooth string, send to bt emitter e.g. btstr:AT+
            bt_emitter.userCommand(r.substring(6, r.length() -1).c_str());
            log_w("btstr: %s", r.substring(6, r.length() -1).c_str());
        }
        if(r.startsWith("tsp")){
            _f_timeSpeech = true;
        }
        if(r.startsWith("pwd")){ // set password for WiFi
            changeState(WIFI_SETTINGS);
        }
        if(r.startsWith("gif")){ // draw gif image
            log_w("gif");
            drawImage("/common/Tom_Jerry.gif", 100, 100);
        }
        if(r.startsWith("bfi")){ // buffer filled
            log_w("inBuffer  :  filled %lu bytes", (long unsigned)audio.inBufferFilled());
            log_w("inBuffer  :  free   %lu bytes", (long unsigned)audio.inBufferFree());
        }
    }
}

/*         ╔═════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════╗
           ║                                                                                  E V E N T S                                                                                ║
           ╚═════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════╝   */

