serggggaae/ESP32-MiniWebRadio/main.cpp
// Events from audioI2S library
void audio_info(const char* info) {
    if(endsWith(  info, "failed!"))                {SerialPrintflnCut("AUDIO_info:  ", ANSI_ESC_YELLOW, info); sprintf(_streamTitle, "" ANSI_ESC_ORANGE "%s", info);
                                                    _f_newStreamTitle = true; _f_webFailed = true; return;}
    if(startsWith(info, "FLAC"))                   {SerialPrintflnCut("AUDIO_info:  ", ANSI_ESC_GREEN, info); return;}
    if(endsWith(  info, "Stream lost"))            {SerialPrintflnCut("AUDIO_info:  ", ANSI_ESC_YELLOW, info); return;}
    if(startsWith(info, "authent"))                {SerialPrintflnCut("AUDIO_info:  ", ANSI_ESC_GREEN, info); return;}
    if(startsWith(info, "StreamTitle="))           {return;}
    if(startsWith(info, "HTTP/") && info[9] > '3') {SerialPrintflnCut("AUDIO_info:  ", ANSI_ESC_RED, info); return;}
    if(startsWith(info, "ERROR:"))                 {SerialPrintflnCut("AUDIO_info:  ", ANSI_ESC_RED, info); return;}
    if(CORE_DEBUG_LEVEL >= ARDUHAL_LOG_LEVEL_WARN) {{SerialPrintfln("AUDIO_info:  " ANSI_ESC_GREEN "%s", info);} return;} // all other
}
//————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
void audio_showstation(const char* info) {
    if(!info) return;
    x_ps_free(&_stationName_air);
    _stationName_air = x_ps_strndup(info, 200); // set max length
    SerialPrintfln("StationName: " ANSI_ESC_MAGENTA "%s", info);
    _f_newStationName = true;
}
//————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
void audio_showstreamtitle(const char* info) {
    strcpy(_streamTitle, info);
    if(!_f_irNumberSeen) _f_newStreamTitle = true;
    SerialPrintfln("StreamTitle: " ANSI_ESC_YELLOW "%s", info);
}
//————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
void show_ST_commercial(const char* info) {
    _commercial_dur = atoi(info) / 1000; // info is the duration of advertising in ms
    char cdur[10];
    itoa(_commercial_dur, cdur, 10);
    if(_f_newCommercial) return;
    strcpy(_commercial, "Advertising: ");
    strcat(_commercial, cdur);
    strcat(_commercial, "s");
    _f_newCommercial = true;
    SerialPrintfln("StreamTitle: %s", info);
}
void audio_commercial(const char* info) { show_ST_commercial(info); }
//————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
void audio_eof_mp3(const char* info) { // end of mp3 file (filename)
    _f_pauseResume = false;
    _f_eof = true;
    _f_isFSConnected = false;
    if(startsWith(info, "alarm")) _f_eof_alarm = true;
    SerialPrintflnCut("end of file: ", ANSI_ESC_YELLOW, info);
    if(_state == PLAYER) {
        if(!_f_playlistEnabled) {
            _playerSubMenue = 0;
            changeState(PLAYER);
        }
    }
    webSrv.send("SD_playFile=", "end of audiofile");
}
//————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
void audio_eof_stream(const char* info) {
    _f_isWebConnected = false;
    SerialPrintflnCut("end of file: ", ANSI_ESC_YELLOW, info);
    if(_state == PLAYER) {
        if(!_f_playlistEnabled) {
            _f_clearLogo = true;
            _f_clearStationName = true;
        }
    }
    if(_state == RADIO)  { clearWithOutHeaderFooter(); }
    if(_state == DLNA)   { txt_DL_fName.setText(""); txt_DL_fName.show(true, false); btn_DL_pause.setActive(false); btn_DL_pause.show();}
    if(_state == PLAYER) { txt_PL_fName.setText(""); txt_PL_fName.show(true, false); }
    _f_eof = true;
}
//————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
void audio_lasthost(const char* info) { // really connected URL
    if(_f_playlistEnabled) return;
    x_ps_free(&_settings.lastconnectedhost);
    _settings.lastconnectedhost = x_ps_strdup(info);
    SerialPrintflnCut("lastURL: ..  ", ANSI_ESC_WHITE, _settings.lastconnectedhost);
    webSrv.send("stationURL=", _settings.lastconnectedhost);
}
//————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
void audio_icyurl(const char* info) { // if the Radio has a homepage, this event is calling
    if(strlen(info) > 5) {
        SerialPrintflnCut("icy-url: ..  ", ANSI_ESC_WHITE, info);
        _homepage = String(info);
        if(!_homepage.startsWith("http")) _homepage = "http://" + _homepage;
    }
}
//————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
void audio_icylogo(const char* info) { // if the Radio has a homepage, this event is calling
    if(strlen(info) > 5) { SerialPrintflnCut("icy-logo:    ", ANSI_ESC_WHITE, info); }
}
//————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
void audio_id3data(const char* info) { SerialPrintfln("id3data: ..  " ANSI_ESC_GREEN "%s", info); }
//————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
void audio_id3image(File& audiofile, const size_t APIC_pos, const size_t APIC_size) { SerialPrintfln("CoverImage:  " ANSI_ESC_GREEN "Position %i, Size %i bytes", APIC_pos, APIC_size); }
//————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
void audio_oggimage(File& audiofile, std::vector<uint32_t> vec) { // OGG blockpicture
    SerialPrintfln("oggimage:..  " ANSI_ESC_GREEN "---------------------------------------------------------------------------");
    SerialPrintfln("oggimage:..  " ANSI_ESC_GREEN "ogg metadata blockpicture found:");
    for(int i = 0; i < vec.size(); i += 2) { SerialPrintfln("oggimage:..  " ANSI_ESC_GREEN "segment %02i, pos %07ld, len %05ld", i / 2, (long unsigned int)vec[i], (long unsigned int)vec[i + 1]); }
    SerialPrintfln("oggimage:..  " ANSI_ESC_GREEN "---------------------------------------------------------------------------");
}
//————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
void audio_icydescription(const char* info) {
    strcpy(_icyDescription, info);
    _f_newIcyDescription = true;
    if(strlen(info)) SerialPrintfln("icy-descr:   %s", info);
}
//————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
void audio_bitrate(const char* info) {
    if(!strlen(info)) return; // guard
    _icyBitRate = str2int(info) / 1000;
    _f_newBitRate = true;
    SerialPrintfln("bitRate:     " ANSI_ESC_CYAN "%iKbit/s", _icyBitRate);
}
//————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
void audio_eof_speech(const char*) {
    ;  // not used yet
}
//————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
void audio_process_i2s(int16_t* outBuff, uint16_t validSamples, bool *continueI2S){

    // int16_t sineWaveTable[44] = {
    //      0,   3743,   7377,  10793,  14082,  17136,  19848,  22113,  23825,  24908,
    //   25311,  24908,  23825,  22113,  19848,  17136,  14082,  10793,   7377,   3743,
    //      0,  -3743,  -7377, -10793, -14082, -17136, -19848, -22113, -23825, -24908,
    //  -25311, -24908, -23825, -22113, -19848, -17136, -14082, -10793,  -7377,  -3743
    // };

    // static uint8_t tabPtr = 0;
    // int16_t* sample[2]; // assume 2 channels, 16bit
    // for(int i= 0; i < validSamples; i++){
    //     *(sample + 0) = outBuff + i * 2;     // channel left
    //     *(sample + 1) = outBuff + i * 2 + 1; // channel right

    //     *(*sample + 0) = (sineWaveTable[tabPtr] /50 + *(*sample + 0));
    //     *(*sample + 1) = (sineWaveTable[tabPtr] /50 + *(*sample + 1));
    //     tabPtr++;
    //     if(tabPtr == 44) tabPtr = 0;
    // }
   *continueI2S = true;
}
//————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
void ftp_debug(const char* info) {
    if(startsWith(info, "File Name")) return;
    SerialPrintfln("ftpServer:   %s", info);
}
//----------------------------------------------------------------------------------------------------------------------------------------------------
// Events from rtime library
void RTIME_info(const char* info) { SerialPrintfln("rtime_info:  %s", info); }
// Events from tft library
void tft_info(const char* info) { SerialPrintfln("tft_info: .  %s", info); }
// Events from tp library
void tp_info(const char* info) { SerialPrintfln("tp_info: ..  %s", info); }
//----------------------------------------------------------------------------------------------------------------------------------------------------
// Events from IR Library
void ir_code(uint8_t addr, uint8_t cmd) {
    SerialPrintfln("ir_code: ..  " ANSI_ESC_YELLOW "IR address " ANSI_ESC_BLUE "0x%02x, " ANSI_ESC_YELLOW "IR command " ANSI_ESC_BLUE "0x%02x", addr, cmd);
    char buf[20];
    sprintf(buf, "0x%02x", addr);
    webSrv.send("IR_address=", buf);
    sprintf(buf, "0x%02x", cmd);
    webSrv.send("IR_command=", buf);
}

void ir_res(uint32_t res) {
    if(_state != RADIO) return;
    if(_f_sleeping == true) return;
    SerialPrintfln("ir_result:   " ANSI_ESC_YELLOW "Stationnumber " ANSI_ESC_BLUE "%lu", (long unsigned)res);
    _f_irResultSeen = true;
    _f_irNumberSeen = false;
    _irResult = res;
    return;
}
void ir_number(uint16_t num) {
    if(_state != RADIO) return;
    if(_f_sleeping) return;
    _f_irNumberSeen = true;
    _irNumber = num;
    _radioSubMenue = 3;
    changeState(RADIO);
}
void ir_short_key(uint8_t key) {
if(_f_sleeping == true && _f_irOnOff) {if(key == 20) wake_up(); return;} else {if(key != 28) {if(!_disptimer2) brightallp(); else if(disptimer) _disptimer2 = _disptimer;}}
    if(_state == IR_SETTINGS) return;  // nothing todo
	if(key == 11 || key == 12 || key == 23 || key == 24 || key == 21 || key == 22) {if(_clockSubMenue == 0 && _state != DLNA && _state != ALARMCLOCK && _state != SLEEPTIMER && _state != SETTINGS && _state != BRIGHTNESS && _state != EQUALIZER && _state != BLUETOOTH) {if(_state1 == PLAYER && _playerSubMenue <= 1 && _state != AUDIOFILESLIST) {Audiold3 = Audiold1; Audiold1 = _cur_AudioFileNr;} if(_state1 == RADIO && _radioSubMenue <= 1 && _state != STATIONSLIST) {Stationold3 = Stationold1; Stationold1 = _cur_station;}}}
	if(key == 27) {if(_cur_station == Stationold1) _cur_station = Stationold2; else if(Stationold3 != _cur_station) _cur_station = Stationold3; else if(Stationold1 != _cur_station) _cur_station = Stationold1; if(Audiold1 == _cur_AudioFileNr) _cur_AudioFileNr = Audiold2; else if(Audiold3 != _cur_AudioFileNr) _cur_AudioFileNr = Audiold3; else if(Audiold1 != _cur_AudioFileNr) _cur_AudioFileNr = Audiold1;}
    switch(key) {
        case 10:     // MUTE
                    muteChanged(!_f_mute);
                    break;
        case 11:    // ARROW RIGHT
                    if(_state == RADIO) {
                        if(_radioSubMenue < 4){btn_RA_nextSta.showClickedPic(); vTaskDelay(100); btn_RA_nextSta.show(); vTaskDelay(100);
                            nextFavStation(); Stationold2 = _cur_station; return;                                  // NEXT STATION
                        }
                        if(_radioSubMenue == 4){ // scroll forward
                            btnNr++;
                            if(btnNr == 1){btn_RA_staList.show(); btn_RA_player.showAlternativePic();}
                            if(btnNr == 2){btn_RA_player.show(); btn_RA_dlna.showAlternativePic();}
                            if(btnNr == 3){btn_RA_dlna.show(); btn_RA_clock.showAlternativePic();}
                            if(btnNr == 4){btn_RA_clock.show(); btn_RA_sleep.showAlternativePic();}
                            if(btnNr == 5){btn_RA_sleep.show(); btn_RA_settings.showAlternativePic();}
                            if(btnNr == 6){btn_RA_settings.show(); btn_RA_bt.showAlternativePic();}
                            if(btnNr == 7){btn_RA_bt.show(); btn_RA_off.showAlternativePic();}
                            if(btnNr == 8){btn_RA_off.show(); btn_RA_staList.showAlternativePic(); btnNr = 0;}
                            setTimeCounter(LIST_TIMER);
                            return;
                        }
                    }
                    if(_state == STATIONSLIST) {    // next page
                        lst_RADIO.nextPage(); setTimeCounter(8);
                        return;
                    }
                    if(_state == PLAYER){
                        if(_playerSubMenue == 2){ // scroll forward
                            btnNr++;
                            if(btnNr == 1){btn_PL_prevFile.show(); btn_PL_nextFile.showAlternativePic();}
                            if(btnNr == 2){btn_PL_nextFile.show(); btn_PL_ready.showAlternativePic();}
                            if(btnNr == 3){btn_PL_ready.show(); btn_PL_playAll.showAlternativePic();}
                            if(btnNr == 4){btn_PL_playAll.show(); btn_PL_shuffle.showAlternativePic();}
                            if(btnNr == 5){btn_PL_shuffle.show(); btn_PL_fileList.showAlternativePic();}
                            if(btnNr == 6){btn_PL_fileList.show(); btn_PL_radio.showAlternativePic();}
                            if(btnNr == 7){btn_PL_radio.show(); btn_PL_off.showAlternativePic();}
                            if(btnNr == 8){btn_PL_off.show(); btn_PL_prevFile.showAlternativePic(); btnNr = 0;}
                            setTimeCounter(LIST_TIMER);
                            return;
                        }
                        if(_playerSubMenue == 3){ // scroll forward (mute, pause, cancel, prev, next)
                            btnNr++;
                            if(btnNr == 1){btn_PL_mute.show(); btn_PL_pause.showAlternativePic();}
                            if(btnNr == 2){btn_PL_pause.show(); btn_PL_cancel.showAlternativePic();}
                            if(btnNr == 3){btn_PL_cancel.show(); btn_PL_playPrev.showAlternativePic();}
                            if(btnNr == 4){btn_PL_playPrev.show(); btn_PL_playNext.showAlternativePic();}
							if(btnNr == 5){btn_PL_playNext.show(); btn_PL_mute.showAlternativePic(); btnNr = 0;}
                            setTimeCounter(LIST_TIMER);
                            return;
                        }
						if(_cur_AudioFileNr + 1 < _SD_content.getSize()) {if(_playerSubMenue == 1) {btn_PL_playNext.showClickedPic(); vTaskDelay(100); btn_PL_playNext.show(); _cur_AudioFileNr = _SD_content.getNextAudioFile(_cur_AudioFileNr);} else _cur_AudioFileNr++; Audiold2 = _cur_AudioFileNr; SD_playFile(_cur_AudioFolder, _SD_content.getColouredSStringByIndex(_cur_AudioFileNr)); showAudioFileNumber();}return;}
						
