serggggaae/ESP32-MiniWebRadio/main.cpp
						if(_state == DLNA){
                        if(_dlnaSubMenue == 1){ // scroll forward (mute, pause, cancel, prev, next)
                            btnNr++;
                            if(btnNr == 1){btn_DL_mute.show(); btn_DL_pause.showAlternativePic();}
                            if(btnNr == 2){btn_DL_pause.show(); btn_DL_cancel.showAlternativePic();}
                            if(btnNr == 3){btn_DL_cancel.show(); btn_DL_fileList.showAlternativePic();}
                            if(btnNr == 4){btn_DL_fileList.show(); btn_DL_radio.showAlternativePic();}
							if(btnNr == 5){btn_DL_radio.show(); btn_DL_mute.showAlternativePic(); btnNr = 0;}
                            setTimeCounter(LIST_TIMER);
                            return;
                        }
                    }
                    if(_state == DLNAITEMSLIST){
                        lst_DLNA.nextPage(); setTimeCounter(8); return; // nextpage
                    }
                    if(_state == CLOCK){
                        if(_clockSubMenue == 2){ // scroll forward (alarm, radio, mute, off)
                            btnNr++;
                            if(btnNr == 1){btn_CL_alarm.show(); btn_CL_radio.showAlternativePic();}
                            if(btnNr == 2){btn_CL_radio.show(); btn_CL_mute.showAlternativePic();}
                            if(btnNr == 3){btn_CL_mute.show(); btn_CL_off.showAlternativePic();}
							if(btnNr == 4){btn_CL_off.show(); btn_CL_alarm.showAlternativePic(); btnNr = 0;}
                            setTimeCounter(LIST_TIMER);
                            return;
                        }
					if(_state1 == RADIO) {nextFavStation(); Stationold2 = _cur_station;} else {if(_cur_AudioFileNr + 1 < _SD_content.getSize()) {_cur_AudioFileNr++; Audiold2 = _cur_AudioFileNr; SD_playFile(_cur_AudioFolder, _SD_content.getColouredSStringByIndex(_cur_AudioFileNr));}} _clockSubMenue = 0; changeState(CLOCK); break;
                    }
                    if(_state == ALARMCLOCK){
                        if(_alarmSubMenue == 1){ // scroll forward (left, right, up, down, ready)
                            btnNr++;
                            if(btnNr == 1){btn_AC_left.show(); btn_AC_right.showAlternativePic();}
                            if(btnNr == 2){btn_AC_right.show(); btn_AC_up.showAlternativePic();}
                            if(btnNr == 3){btn_AC_up.show(); btn_AC_down.showAlternativePic();}
                            if(btnNr == 4){btn_AC_down.show(); btn_AC_ready.showAlternativePic();}
							if(btnNr == 5){btn_AC_ready.show(); btn_AC_left.showAlternativePic(); btnNr = 0;}
                            setTimeCounter(LIST_TIMER);
                            return;
                        }
                    }
                    if(_state == SLEEPTIMER){
                        if(_sleepTimerSubMenue == 1){ // scroll forward (up, down, ready, cancel)
                            btnNr++;
                            if(btnNr == 1){btn_SL_up.show(); btn_SL_down.showAlternativePic();}
                            if(btnNr == 2){btn_SL_down.show(); btn_SL_ready.showAlternativePic();}
                            if(btnNr == 3){btn_SL_ready.show(); btn_SL_cancel.showAlternativePic();}
							if(btnNr == 4){btn_SL_cancel.show(); btn_SL_up.showAlternativePic(); btnNr = 0;}
                            setTimeCounter(LIST_TIMER);
                            return;
                        }
						btn_SL_up.showClickedPic(); vTaskDelay(100); btn_SL_up.show(); display_sleeptime(1); break;
                    }
                    if(_state == SETTINGS){
                        if(_settingsSubMenue == 1){ // scroll forward (bright, equal, wifi, radio)
                            btnNr++;
                            if(btnNr == 1){btn_SE_bright.show(); btn_SE_equal.showAlternativePic();}
                            if(btnNr == 2){btn_SE_equal.show(); btn_SE_wifi.showAlternativePic();}
                            if(btnNr == 3){btn_SE_wifi.show(); btn_SE_radio.showAlternativePic();}
							if(btnNr == 4){btn_SE_radio.show(); btn_SE_bright.showAlternativePic(); btnNr = 0;}
                            setTimeCounter(LIST_TIMER);
                            return;
                        }
                    }
					if(_state == EQUALIZER){
                        if(_equalizerSubMenue == 1){
                            char c[10];
                            if(btnNr == 10){if(_toneBAL < 16){_toneBAL++; itoa(_toneBAL, c, 10); txt_EQ_balance.writeText(c); sdr_EQ_balance.setValue(_toneBAL);} webSrv.send("settone=", setI2STone()); setTimeCounter(2); return;} // balance
                            if(btnNr == 20){if(_toneLP < 6){_toneLP++; itoa(_toneLP, c, 10); txt_EQ_lowPass.writeText( c); sdr_EQ_lowPass.setValue(_toneLP);} webSrv.send("settone=", setI2STone()); setTimeCounter(2); return;} // HP
                            if(btnNr == 30){if(_toneBP < 6){_toneBP++; itoa(_toneBP, c, 10); txt_EQ_bandPass.writeText(c); sdr_EQ_bandPass.setValue(_toneBP);} webSrv.send("settone=", setI2STone()); setTimeCounter(2); return;} // BP
                            if(btnNr == 40){if(_toneHP < 6){_toneHP++; itoa(_toneHP, c, 10); txt_EQ_highPass.writeText(c); sdr_EQ_highPass.setValue(_toneHP);} webSrv.send("settone=", setI2STone()); setTimeCounter(2); return;} // LP
							btnNr++;
							if(btnNr == 1) {btnNr2 = 1; btn_EQ_Radio.show(); btn_EQ_Player.showAlternativePic(); setTimeCounter(2); return;}
                            if(btnNr == 2) {btnNr2 = 2; btn_EQ_Player.show(); btn_EQ_mute.showAlternativePic(); setTimeCounter(2); return;}
							if(btnNr == 3) {btnNr2 = 0; btn_EQ_mute.show(); btn_EQ_Radio.showAlternativePic(); btnNr = 0; setTimeCounter(2); return;}
							return;
                        }
                    }
					if(_state == BRIGHTNESS) {if(disptimer55) {_brightness=_brightness + 5; if(_brightness > 100) _brightness = 100; sdr_BR_value.setValue(_brightness); txt_BR_value.writeText(int2str(current_brightness));} else {_disptimer3=_disptimer3 + 1; if(_disptimer3 > 100) _disptimer3 = 100; txt_BR_value.writeText(int2str(_disptimer3));} break;}
					if(_state == AUDIOFILESLIST) {lst_PLAYER.nextPage(); setTimeCounter(8); break;} // next page
					if(_state == BLUETOOTH) {btn_BT_power.showClickedPic(); vTaskDelay(100); btn_BT_power.show(); _f_BTpower = !_f_BTcurPowerState; BTpowerChanged(!_f_BTcurPowerState); break;}
					break;
        case 12:    // ARROW LEFT
                    if(_state == RADIO) {
                        if(_radioSubMenue < 4){btn_RA_prevSta.showClickedPic(); vTaskDelay(100); btn_RA_prevSta.show(); vTaskDelay(100);
                             prevFavStation(); Stationold2 = _cur_station; return;               // PREV STATION
                        }
                        if(_radioSubMenue == 4){ // scroll backward
							if(btnNr == 0) btnNr = 8;
                            btnNr--;
                            if(btnNr == 0){btn_RA_staList.showAlternativePic(); btn_RA_player.show();}
                            if(btnNr == 1){btn_RA_player.showAlternativePic(); btn_RA_dlna.show();}
                            if(btnNr == 2){btn_RA_dlna.showAlternativePic(); btn_RA_clock.show();}
                            if(btnNr == 3){btn_RA_clock.showAlternativePic(); btn_RA_sleep.show();}
                            if(btnNr == 4){btn_RA_sleep.showAlternativePic(); btn_RA_settings.show();}
                            if(btnNr == 5){btn_RA_settings.showAlternativePic(); btn_RA_bt.show();}
                            if(btnNr == 6){btn_RA_bt.showAlternativePic(); btn_RA_off.show();}
                            if(btnNr == 7){btn_RA_off.showAlternativePic(); btn_RA_staList.show();}
                            setTimeCounter(LIST_TIMER);
                            return;
                        }
                    }
                    if(_state == STATIONSLIST) {lst_RADIO.prevPage(); setTimeCounter(8); break;}    // prev page
                    if(_state == PLAYER){
                        if(_playerSubMenue == 2){ // scroll backward
							if(btnNr == 0) btnNr = 8;
                            btnNr--;
                            if(btnNr == 0){btn_PL_prevFile.showAlternativePic(); btn_PL_nextFile.show();}
                            if(btnNr == 1){btn_PL_nextFile.showAlternativePic(); btn_PL_ready.show();}
                            if(btnNr == 2){btn_PL_ready.showAlternativePic(); btn_PL_playAll.show();}
                            if(btnNr == 3){btn_PL_playAll.showAlternativePic(); btn_PL_shuffle.show();}
                            if(btnNr == 4){btn_PL_shuffle.showAlternativePic(); btn_PL_fileList.show();}
                            if(btnNr == 5){btn_PL_fileList.showAlternativePic(); btn_PL_radio.show();}
                            if(btnNr == 6){btn_PL_radio.showAlternativePic(); btn_PL_off.show();}
                            if(btnNr == 7){btn_PL_off.showAlternativePic(); btn_PL_prevFile.show();}
                            setTimeCounter(LIST_TIMER);
                            return;
                        }
                        if(_playerSubMenue == 3){ // scroll backward (mute, pause, cancel, prev, next)
							if(btnNr == 0) btnNr = 5;
							btnNr--;
                            if(btnNr == 0){btn_PL_mute.showAlternativePic(); btn_PL_pause.show();}
                            if(btnNr == 1){btn_PL_pause.showAlternativePic(); btn_PL_cancel.show();}
                            if(btnNr == 2){btn_PL_cancel.showAlternativePic(); btn_PL_playPrev.show();}
                            if(btnNr == 3){btn_PL_playPrev.showAlternativePic(); btn_PL_playNext.show();}
							if(btnNr == 4){btn_PL_playNext.showAlternativePic(); btn_PL_mute.show();}
                            setTimeCounter(LIST_TIMER);
                            return;
                        }
                     if(_cur_AudioFileNr > 0) {if(_playerSubMenue == 1) {btn_PL_playPrev.showClickedPic(); vTaskDelay(100); btn_PL_playPrev.show(); _cur_AudioFileNr = _SD_content.getPrevAudioFile(_cur_AudioFileNr);} else _cur_AudioFileNr--; Audiold2 = _cur_AudioFileNr; SD_playFile(_cur_AudioFolder, _SD_content.getColouredSStringByIndex(_cur_AudioFileNr)); showAudioFileNumber();}return;}
					 
                    if(_state == DLNA){
                        if(_dlnaSubMenue == 1){ // scroll backward (mute, pause, cancel, prev, next)
							if(btnNr == 0) btnNr = 5;
							btnNr--;
                            if(btnNr == 0){btn_DL_mute.showAlternativePic(); btn_DL_pause.show();}
                            if(btnNr == 1){btn_DL_pause.showAlternativePic(); btn_DL_cancel.show();}
                            if(btnNr == 2){btn_DL_cancel.showAlternativePic(); btn_DL_fileList.show();}
                            if(btnNr == 3){btn_DL_fileList.showAlternativePic(); btn_DL_radio.show();}
							if(btnNr == 4){btn_DL_radio.showAlternativePic(); btn_DL_mute.show();}
                            setTimeCounter(LIST_TIMER);
                            return;
                        }
                    }
                    if(_state == DLNAITEMSLIST){
                        lst_DLNA.prevPage(); setTimeCounter(LIST_TIMER); return; // prev page
                    }

