serggggaae/ESP32-MiniWebRadio/main.cpp
                    if(_state == CLOCK){
                        if(_clockSubMenue == 2){ // scroll backward (alarm, radio, mute, off)
							if(btnNr == 0) btnNr = 4;
							btnNr--;
                            if(btnNr == 0){btn_CL_alarm.showAlternativePic(); btn_CL_radio.show();}
                            if(btnNr == 1){btn_CL_radio.showAlternativePic(); btn_CL_mute.show();}
                            if(btnNr == 2){btn_CL_mute.showAlternativePic(); btn_CL_off.show();}
							if(btnNr == 3){btn_CL_off.showAlternativePic(); btn_CL_alarm.show();}
                            setTimeCounter(LIST_TIMER);
                            return;
                        }
					if(_state1 == RADIO) {prevFavStation(); Stationold2 = _cur_station;} else {if(_cur_AudioFileNr > 0) {_cur_AudioFileNr--; Audiold2 = _cur_AudioFileNr; SD_playFile(_cur_AudioFolder, _SD_content.getColouredSStringByIndex(_cur_AudioFileNr));}} _clockSubMenue = 0; changeState(CLOCK); break;
                    }
                    if(_state == ALARMCLOCK){
                        if(_alarmSubMenue == 1){ // scroll backward (left, right, up, down, ready)
							if(btnNr == 0) btnNr = 5;
							btnNr--;
                            if(btnNr == 0){btn_AC_left.showAlternativePic(); btn_AC_right.show();}
                            if(btnNr == 1){btn_AC_right.showAlternativePic(); btn_AC_up.show();}
                            if(btnNr == 2){btn_AC_up.showAlternativePic(); btn_AC_down.show();}
                            if(btnNr == 3){btn_AC_down.showAlternativePic(); btn_AC_ready.show();}
							if(btnNr == 4){btn_AC_ready.showAlternativePic(); btn_AC_left.show();}
                            setTimeCounter(LIST_TIMER);
                            return;
                        }
                    }
                    if(_state == SLEEPTIMER){
                        if(_sleepTimerSubMenue == 1){ // scroll backward (up, down, ready, cancel)
							if(btnNr == 0) btnNr = 4;
							btnNr--;
                            if(btnNr == 0){btn_SL_up.showAlternativePic(); btn_SL_down.show();}
                            if(btnNr == 1){btn_SL_down.showAlternativePic(); btn_SL_ready.show();}
                            if(btnNr == 2){btn_SL_ready.showAlternativePic(); btn_SL_cancel.show();}
							if(btnNr == 3){btn_SL_cancel.showAlternativePic(); btn_SL_up.show();}
                            setTimeCounter(LIST_TIMER);
                            return;
                        }
						btn_SL_down.showClickedPic(); vTaskDelay(100); btn_SL_down.show(); display_sleeptime(-1); break;
                    }
                    if(_state == SETTINGS){
                        if(_settingsSubMenue == 1){ // scroll forward (bright, equal, radio)
							if(btnNr == 0) btnNr = 4;
							btnNr--;
                            if(btnNr == 0){btn_SE_bright.showAlternativePic(); btn_SE_equal.show();}
                            if(btnNr == 1){btn_SE_equal.showAlternativePic(); btn_SE_wifi.show();}
                            if(btnNr == 2){btn_SE_wifi.showAlternativePic(); btn_SE_radio.show();}
							if(btnNr == 3){btn_SE_radio.showAlternativePic(); btn_SE_bright.show();}
                            setTimeCounter(LIST_TIMER);
                            return;
                        }
                    }
					if(_state == EQUALIZER){
                        if(_equalizerSubMenue == 1){
                            char c[10];
                            if(btnNr == 10){if(_toneBAL > -16){_toneBAL--; itoa(_toneBAL, c, 10); txt_EQ_balance.writeText(c); sdr_EQ_balance.setValue(_toneBAL);} webSrv.send("settone=", setI2STone()); setTimeCounter(2); return;} // balance
                            if(btnNr == 20){if(_toneLP > -40){_toneLP--; itoa(_toneLP, c, 10); txt_EQ_lowPass.writeText(c); sdr_EQ_lowPass.setValue(_toneLP);} webSrv.send("settone=", setI2STone()); setTimeCounter(2); return;} // LP
                            if(btnNr == 30){if(_toneBP > -40){_toneBP--; itoa(_toneBP, c, 10); txt_EQ_bandPass.writeText(c); sdr_EQ_bandPass.setValue(_toneBP);} webSrv.send("settone=", setI2STone()); setTimeCounter(2); return;} // BP
                            if(btnNr == 40){if(_toneHP > -40){_toneHP--; itoa(_toneHP, c, 10); txt_EQ_highPass.writeText(c); sdr_EQ_highPass.setValue(_toneHP);} webSrv.send("settone=", setI2STone()); setTimeCounter(2); return;} // HP
							if(btnNr == 0) btnNr = 3;
							btnNr--;
                            if(btnNr == 0) {btnNr2 = 0; btn_EQ_Player.show(); btn_EQ_Radio.showAlternativePic(); setTimeCounter(2); return;}
                            if(btnNr == 1) {btnNr2 = 1; btn_EQ_mute.show(); btn_EQ_Player.showAlternativePic(); setTimeCounter(2); return;}
							if(btnNr == 2){btnNr2 = 2; btn_EQ_mute.showAlternativePic(); btn_EQ_Radio.show(); setTimeCounter(2); return;}
							return;
                        }
                    }
					if(_state == BRIGHTNESS) {if(disptimer55) {_brightness=_brightness - 5; if(_brightness < 5) _brightness = 5; sdr_BR_value.setValue(_brightness); txt_BR_value.writeText(int2str(current_brightness));} else { if(_disptimer3) _disptimer3 = _disptimer3 - 1; txt_BR_value.writeText(int2str(_disptimer3));} break;}
					if(_state == AUDIOFILESLIST) {lst_PLAYER.prevPage(); setTimeCounter(8); break;} // prev page
					if(_state == BLUETOOTH) if(_f_BTpower) {btn_BT_mode.showClickedPic(); vTaskDelay(100); btn_BT_mode.show(); bt_emitter.changeMode(); break;}
					break;
		case 13:    // ARROW DOWN
		            if(_state == BRIGHTNESS) {if(disptimer55) {_brightness2=_brightness2 - 1; if(_brightness2 < 1) _brightness2 = 1; txt_BR_value.writeText(int2str(_brightness2));} else {_disptimer=_disptimer - 1; if(_disptimer < 1) _disptimer = 1; txt_BR_value.writeText(int2str(_disptimer));} break;}
					if(_state == BLUETOOTH) if(_f_BTpower) { if(_BTvolume > 0) {btn_BT_volDown.showClickedPic(); vTaskDelay(100); btn_BT_volDown.show(); _BTvolume--; bt_emitter.downvolume();} break;}
                    if(_state == STATIONSLIST) {lst_RADIO.nextStation(); setTimeCounter(8); break;} // station++
					if(_state == AUDIOFILESLIST){lst_PLAYER.nextFile(); setTimeCounter(8); break;} // file++
					if(_state == DLNAITEMSLIST){lst_DLNA.nextItem(); setTimeCounter(8); return;} // item++
					if(_state == EQUALIZER && _equalizerSubMenue == 1){
						if(btnNr > 10) btnNr -= 10;
						else if(btnNr == 10) btnNr = btnNr2;
						else if(btnNr == 0||1||2) btnNr = 40;
						if(btnNr == 10){btn_EQ_balance.showAlternativePic();  btn_EQ_lowPass.show();}
                        if(btnNr == 20){btn_EQ_lowPass.showAlternativePic();  btn_EQ_bandPass.show();}
                        if(btnNr == 30){btn_EQ_bandPass.showAlternativePic(); btn_EQ_highPass.show();}
						if(btnNr == 40){btn_EQ_highPass.showAlternativePic(); btn_EQ_Radio.show(); btn_EQ_Player.show(); btn_EQ_mute.show();}
						if(btnNr == 0){btn_EQ_Radio.showAlternativePic();  btn_EQ_balance.show();}
						if(btnNr == 1){btn_EQ_Player.showAlternativePic();  btn_EQ_balance.show();}
						if(btnNr == 2){btn_EQ_mute.showAlternativePic();  btn_EQ_balance.show();}
						setTimeCounter(2); return;
                    }
					downvolume(); 
					if(_state == RADIO)  {txt_RA_staName.hide(); volBox.enable(); volBox.setNumbers(_cur_volume); volBox.show(); setTimeCounter(2); break;} // VOLUME--
					if(_state == PLAYER) {txt_PL_fName.hide();   volBox.enable(); volBox.setNumbers(_cur_volume); volBox.show(); setTimeCounter(2); break;} // VOLUME--
					if(_state == DLNA)  {txt_DL_fName.hide(); volBox.enable(); volBox.setNumbers(_cur_volume); volBox.show(); setTimeCounter(2); break;} // VOLUME--
					break;
		case 14:    // ARROW UP
					if(_state == BRIGHTNESS) {if(disptimer55) {_brightness2=_brightness2 + 1; if(_brightness2 > 100) _brightness2 = 100; txt_BR_value.writeText(int2str(_brightness2));} else {_disptimer=_disptimer + 1; if(_disptimer > 100) _disptimer = 100; txt_BR_value.writeText(int2str(_disptimer));} break;}
					if(_state == BLUETOOTH) if(_f_BTpower) { if(_BTvolume < 31) {btn_BT_volUp.showClickedPic(); vTaskDelay(100); btn_BT_volUp.show(); _BTvolume++; bt_emitter.upvolume();} break;}
                    if(_state == STATIONSLIST) {lst_RADIO.prevStation(); setTimeCounter(8); break;} // station--
                    if(_state == AUDIOFILESLIST){lst_PLAYER.prevFile(); setTimeCounter(8); break;} // file-
					if(_state == DLNAITEMSLIST){lst_DLNA.prevItem(); setTimeCounter(8); return;} // item++
					if(_state == EQUALIZER && _equalizerSubMenue == 1){
                        if(btnNr >= 10 && btnNr < 40) btnNr += 10;
						else if(btnNr == 40) btnNr = btnNr2;
						else if(btnNr == 0||1||2) btnNr = 10;
						if (btnNr == 0){btn_EQ_Radio.showAlternativePic(); btn_EQ_highPass.show();}
						if (btnNr == 1){btn_EQ_Player.showAlternativePic(); btn_EQ_highPass.show();}
						if (btnNr == 2){btn_EQ_mute.showAlternativePic(); btn_EQ_highPass.show();}
						if(btnNr == 10){btn_EQ_balance.showAlternativePic(); btn_EQ_Radio.show(); btn_EQ_Player.show(); btn_EQ_mute.show();}
                        if(btnNr == 20){btn_EQ_lowPass.showAlternativePic();  btn_EQ_balance.show();}
                        if(btnNr == 30){btn_EQ_bandPass.showAlternativePic(); btn_EQ_lowPass.show();}
                        if(btnNr == 40){btn_EQ_highPass.showAlternativePic(); btn_EQ_bandPass.show();}
						setTimeCounter(2); return;
                    }
					upvolume(); 
					if(_state == RADIO)  {txt_RA_staName.hide(); volBox.enable(); volBox.setNumbers(_cur_volume); volBox.show(); setTimeCounter(2); break;} // VOLUME++
					if(_state == PLAYER) {txt_PL_fName.hide();   volBox.enable(); volBox.setNumbers(_cur_volume); volBox.show(); setTimeCounter(2); break;} // VOLUME++
					if(_state == DLNA)  {txt_DL_fName.hide(); volBox.enable(); volBox.setNumbers(_cur_volume); volBox.show(); setTimeCounter(2); break;} // VOLUME++
                    break;
		case 15:    // MODE
					if(_state1 == RADIO) _state1 = PLAYER; else _state1 = RADIO; SubMenueAll();
					break;
        case 16:    // OK
                    if(_state == RADIO) {
                       if(_radioSubMenue == 4){
                            if(btnNr == 0){btn_RA_staList.showClickedPic(); vTaskDelay(100); changeState(STATIONSLIST); setTimeCounter(LIST_TIMER); break;}
                            if(btnNr == 1){btn_RA_player.showClickedPic(); vTaskDelay(100); _state1 = PLAYER; _playerSubMenue = 2; changeState(PLAYER);       setTimeCounter(LIST_TIMER); break;}
                            if(btnNr == 2){btn_RA_dlna.showClickedPic();   vTaskDelay(100); _state1 = DLNA; _dlnaSubMenue = 1; changeState(DLNA); setTimeCounter(LIST_TIMER); break;}
                            if(btnNr == 3){btn_RA_clock.showClickedPic();  vTaskDelay(100); _state2 = CLOCK;  _clockSubMenue = 2;      changeState(CLOCK);        setTimeCounter(LIST_TIMER); break;}
                            if(btnNr == 4){btn_RA_sleep.showClickedPic();  vTaskDelay(100); _sleepTimerSubMenue = 1; changeState(SLEEPTIMER);   setTimeCounter(LIST_TIMER); break;}
                            if(btnNr == 5){btn_RA_settings.showClickedPic(); vTaskDelay(100); _settingsSubMenue = 1;   changeState(SETTINGS);     setTimeCounter(LIST_TIMER); break;}
                            if(btnNr == 6){btn_RA_bt.showClickedPic();     vTaskDelay(100); changeState(BLUETOOTH); break;}
                            if(btnNr == 7){btn_RA_off.showClickedPic();    vTaskDelay(100); fall_asleep(); break;}
							break;
                        }
					}
                    if(_state == PLAYER){
                        if(_playerSubMenue == 2){
                            if(btnNr == 0){ // prev AudioFile
                                            btn_PL_prevFile.showClickedPic(); vTaskDelay(50); btn_PL_prevFile.showAlternativePic(); if(_cur_AudioFileNr > 0) {Audiold1 = _cur_AudioFileNr; _cur_AudioFileNr--;
                                            showFileName(_SD_content.getColouredSStringByIndex(_cur_AudioFileNr)); showAudioFileNumber(); setTimeCounter(4);} return;}
                            if(btnNr == 1){ // next AudioFile
                                            btn_PL_nextFile.showClickedPic(); vTaskDelay(50); btn_PL_nextFile.showAlternativePic(); if(_cur_AudioFileNr + 1 < _SD_content.getSize()) {Audiold1 = _cur_AudioFileNr; _cur_AudioFileNr++;
                                            showFileName(_SD_content.getColouredSStringByIndex(_cur_AudioFileNr)); showAudioFileNumber(); setTimeCounter(4);} return;}
                            if(btnNr == 2){ // play file
											btn_PL_ready.showClickedPic(); vTaskDelay(100); stopSong(); SD_playFile(_cur_AudioFolder, _SD_content.getColouredSStringByIndex(_cur_AudioFileNr)); if(Audiold1 != _cur_AudioFileNr) Audiold2 = _cur_AudioFileNr;
                                            _playerSubMenue = 3; changeState(PLAYER); showAudioFileNumber(); setTimeCounter(LIST_TIMER); return;}
                            if(btnNr == 3){ // play all files
                                            btn_PL_playAll.showClickedPic(); vTaskDelay(100); _f_shuffle = false; preparePlaylistFromSDFolder(_cur_AudioFolder); processPlaylist(true);
                                            _playerSubMenue = 1; changeState(PLAYER); return;}
                            if(btnNr == 4){ // shuffle and play all files
                                            btn_PL_shuffle.showClickedPic(); vTaskDelay(100);  _f_shuffle = true; preparePlaylistFromSDFolder(_cur_AudioFolder); processPlaylist(true);
                                            _playerSubMenue = 1; changeState(PLAYER); return;}
                            if(btnNr == 5){ // show file list
                                            btn_PL_fileList.showClickedPic(); vTaskDelay(100); _SD_content.listFilesInDir(_cur_AudioFolder, true, false);
                                            changeState(AUDIOFILESLIST); return;}
                            if(btnNr == 6){ // back to radio
                                            btn_PL_radio.showClickedPic(); vTaskDelay(100); setStation(_cur_station); _state1 = RADIO; _radioSubMenue = 4; changeState(RADIO); return;}
                            if(btnNr == 7){ // off
                                            btn_PL_off.showClickedPic(); vTaskDelay(100); fall_asleep(); return;}
											break;
                        }
                        if(_playerSubMenue == 3){
                            if(btnNr == 0){ // mute
                                            btn_PL_mute.showClickedPic(); muteChanged(!_f_mute); vTaskDelay(100); btn_PL_mute.showAlternativePic(); setTimeCounter(LIST_TIMER); return;
                            }
                            if(btnNr == 1){ // pause
                                            btn_PL_pause.showClickedPic(); if(_f_isFSConnected) {_f_pauseResume = audio.pauseResume(); if(!audio.isRunning()) btn_PL_pause.setOn(); else btn_PL_pause.setOff();}
                                            vTaskDelay(100); btn_PL_pause.showAlternativePic(); setTimeCounter(LIST_TIMER); return;
                            }
                            if(btnNr == 2){ // cancel
                                            btn_PL_cancel.showClickedPic(); vTaskDelay(100); _playerSubMenue = 2; stopSong(); changeState(PLAYER); return;
                            }
                            if(btnNr == 3){ // prev
                                            btn_PL_playPrev.showClickedPic(); vTaskDelay(100); btn_PL_playPrev.showAlternativePic(); Audiold1 = _cur_AudioFileNr; _cur_AudioFileNr = _SD_content.getPrevAudioFile(_cur_AudioFileNr); Audiold2 = _cur_AudioFileNr;
                                            SD_playFile(_cur_AudioFolder, _SD_content.getColouredSStringByIndex(_cur_AudioFileNr)); showAudioFileNumber(); setTimeCounter(LIST_TIMER); return;
                            }
                            if(btnNr == 4){ // next
                                            btn_PL_playNext.showClickedPic(); vTaskDelay(100); btn_PL_playNext.showAlternativePic(); Audiold1 = _cur_AudioFileNr; _cur_AudioFileNr = _SD_content.getNextAudioFile(_cur_AudioFileNr); Audiold2 = _cur_AudioFileNr;
                                            SD_playFile(_cur_AudioFolder, _SD_content.getColouredSStringByIndex(_cur_AudioFileNr)); showAudioFileNumber(); setTimeCounter(LIST_TIMER); return;
                            }
                        }
					}
                    if(_state == DLNA) {
                        if(_dlnaSubMenue == 1) {
                            if(btnNr == 0){ // mute
                                            btn_DL_mute.showClickedPic(); muteChanged(!_f_mute); vTaskDelay(100); btn_DL_mute.showAlternativePic(); setTimeCounter(LIST_TIMER); return;}
                            if(btnNr == 1){ // pause
                                            if(!btn_DL_pause.getActive()) {setTimeCounter(LIST_TIMER); return;}// is inactive
                                            btn_DL_pause.showClickedPic(); if(_f_isWebConnected) {_f_pauseResume = audio.pauseResume(); if(!audio.isRunning()) btn_DL_pause.setOn(); else btn_DL_pause.setOff();}
                                            vTaskDelay(100); btn_DL_pause.showAlternativePic(); setTimeCounter(LIST_TIMER); return;}
                            if(btnNr == 2){ // cancel
                                            btn_DL_cancel.showClickedPic(); vTaskDelay(100); btn_DL_cancel.show(); stopSong(); txt_DL_fName.setText(""); txt_DL_fName.hide(); pgb_DL_progress.reset();
                                            btn_DL_pause.setActive(false); btn_DL_pause.show(); setTimeCounter(LIST_TIMER); return;}
                            if(btnNr == 3){ // dlna list
                                            changeState(DLNAITEMSLIST); txt_DL_fName.setText(""); return;}
                            if(btnNr == 4){ // back to radio
                                            btn_DL_radio.showClickedPic(); vTaskDelay(100); setStation(_cur_station); _state1 = RADIO; _radioSubMenue = 4; changeState(RADIO); return;}
											break;
                        }
                    }
                    if(_state == DLNAITEMSLIST) {setTimeCounter(2); const char* r = lst_DLNA.getSelectedURL();
                                                 if(r){txt_DL_fName.setTextColor(TFT_CYAN); txt_DL_fName.setText(lst_DLNA.getSelectedTitle());
                                                       _dlnaSubMenue = 0; changeState(DLNA); connecttohost(r);}
                                                 break;
                    }
                    if(_state == CLOCK){
                        if(_clockSubMenue == 2){
                            if(btnNr == 0){ // Alarm
                                            _alarmSubMenue = 1; btn_CL_alarm.showClickedPic(); vTaskDelay(100); changeState(ALARMCLOCK); return;}
                            if(btnNr == 1){ // Radio
                                            btn_CL_radio.showClickedPic(); vTaskDelay(100); setStation(_cur_station); _state1 = RADIO; _state2 = UNDEFINED; _radioSubMenue = 4; changeState(RADIO); return;}
                            if(btnNr == 2){ // mute
                                            btn_CL_mute.showClickedPic(); muteChanged(!_f_mute); vTaskDelay(100); btn_CL_mute.showAlternativePic(); setTimeCounter(LIST_TIMER); return;}
                            if(btnNr == 3){ // Off
                                            btn_CL_off.showClickedPic(); vTaskDelay(100); fall_asleep(); return;}
											break;
                        }
                    }
                    if(_state == ALARMCLOCK){
                        if(_alarmSubMenue == 1){
                            if(btnNr == 0){ // pos left
                                btn_AC_left.showClickedPic(); clk_AC_red.shiftLeft(); btn_AC_left.showAlternativePic(); setTimeCounter(LIST_TIMER); return;}
                            if(btnNr == 1){ // pos right
                                btn_AC_right.showClickedPic(); clk_AC_red.shiftRight(); btn_AC_right.showAlternativePic(); setTimeCounter(LIST_TIMER); return;}
                            if(btnNr == 2){ // pos +1
                                btn_AC_up.showClickedPic(); clk_AC_red.digitUp(); btn_AC_up.showAlternativePic(); setTimeCounter(LIST_TIMER); return;}
                            if(btnNr == 3){ // pos -1
                                btn_AC_down.showClickedPic(); clk_AC_red.digitDown(); btn_AC_down.showAlternativePic(); setTimeCounter(LIST_TIMER); return;}
                            if(btnNr == 4){ // ready
                                btn_AC_ready.showClickedPic(); vTaskDelay(100); updateSettings(); _state2 = CLOCK; _clockSubMenue = 0; changeState(CLOCK); logAlarmItems(); return;}
								break;
                        }
								btn_AC_ready.showClickedPic(); vTaskDelay(100); updateSettings(); _state2 = CLOCK; _clockSubMenue = 0; changeState(CLOCK); logAlarmItems(); return;
	               }
                    if(_state == SLEEPTIMER) {
                            if(_sleepTimerSubMenue == 1){
                            if(btnNr == 0){btn_SL_up.showClickedPic(); display_sleeptime(1); btn_SL_up.showAlternativePic(); return;}
                            if(btnNr == 1){btn_SL_down.showClickedPic(); display_sleeptime(-1); btn_SL_down.showAlternativePic(); return;}
                            if(btnNr == 2){btn_SL_ready.showClickedPic(); vTaskDelay(100); dispFooter.updateOffTime(_sleeptime); SubMenueAll(); return;}
                            if(btnNr == 3){btn_SL_cancel.showClickedPic(); vTaskDelay(100); SubMenueAll(); return;}
							break;
                        }
						btn_SL_ready.showClickedPic(); vTaskDelay(100); dispFooter.updateOffTime(_sleeptime); SubMenueAll(); break;
                    }
                    if(_state == SETTINGS){
                        if(_settingsSubMenue == 1){
                            if(btnNr == 0){btn_SE_bright.showClickedPic(); vTaskDelay(100); _brightnessSubMenue = 1;  changeState(BRIGHTNESS); setTimeCounter(LIST_TIMER); return;}
                            if(btnNr == 1){btn_SE_equal.showClickedPic(); vTaskDelay(100); _equalizerSubMenue = 1; changeState(EQUALIZER); setTimeCounter(LIST_TIMER); return;}
							if(btnNr == 2){btn_SE_wifi.showClickedPic(); vTaskDelay(100); changeState(WIFI_SETTINGS); return;}
							if(btnNr == 3){btn_SE_radio.showClickedPic(); vTaskDelay(100); _state1 = RADIO; _radioSubMenue = 0; changeState(RADIO); return;}
							break;
                        }
                    }
                    if(_state == EQUALIZER){
                        if(_equalizerSubMenue == 1){
                            if(btnNr == 0){btn_EQ_Radio.showClickedPic(); vTaskDelay(100);  setStation(_cur_station); _state1 = RADIO; _radioSubMenue = 0; changeState(RADIO); return;} // Radio
                            if(btnNr == 1){btn_EQ_Player.showClickedPic(); vTaskDelay(100); _state1 = PLAYER; _playerSubMenue = 0; changeState(PLAYER); return;} // Player
                            if(btnNr == 2){btn_EQ_mute.showClickedPic(); vTaskDelay(100);  muteChanged(!_f_mute); btn_EQ_mute.showAlternativePic(); setTimeCounter(LIST_TIMER); return;} // mute
                            if(btnNr == 10){btn_EQ_balance.showClickedPic(); _toneBAL = 0; txt_EQ_balance.writeText("0");  sdr_EQ_balance.setValue(_toneLP);  webSrv.send("settone=", setI2STone()); btn_EQ_balance.showAlternativePic();}
                            if(btnNr == 20){btn_EQ_lowPass.showClickedPic();  _toneLP = 0; txt_EQ_lowPass.writeText("0");  sdr_EQ_lowPass.setValue(_toneLP);  webSrv.send("settone=", setI2STone()); btn_EQ_lowPass.showAlternativePic();}
                            if(btnNr == 30){btn_EQ_bandPass.showClickedPic(); _toneBP = 0; txt_EQ_bandPass.writeText("0"); sdr_EQ_bandPass.setValue(_toneLP); webSrv.send("settone=", setI2STone()); btn_EQ_bandPass.showAlternativePic();}
