serggggaae/ESP32-MiniWebRadio/main.cpp
                            if(btnNr == 40){btn_EQ_highPass.showClickedPic(); _toneHP = 0; txt_EQ_highPass.writeText("0"); sdr_EQ_highPass.setValue(_toneLP); webSrv.send("settone=", setI2STone()); btn_EQ_highPass.showAlternativePic();}
							break;
                        }
                    }
					if(_state == STATIONSLIST) {if(Stationold2 != lst_RADIO.getSelectedStation()) {Stationold3 = Stationold1; Stationold1 = _cur_station;} setStationByNumber(lst_RADIO.getSelectedStation()); if(Stationold1 != _cur_station) Stationold2 = _cur_station; SubMenueAll(); break;}
					if(_state == BRIGHTNESS) {if(_brightnessSubMenue == 1) {btn_BR_ready.showClickedPic(); vTaskDelay(100); btn_BR_ready.show(); SubMenueAll();} else {disptimer55= !disptimer55; if(disptimer55) {btn_SE_bright.showClickedPic(); vTaskDelay(100); btn_SE_bright.show(); vTaskDelay(500); txt_BR_value.writeText(int2str(current_brightness));} else {btn_SE_equal.showClickedPic(); vTaskDelay(100); btn_SE_equal.show(); vTaskDelay(500); txt_BR_value.writeText(int2str(_disptimer3));}} break;}
					if(_state == AUDIOFILESLIST) {if(Audiold2 != lst_PLAYER.getSelectedFileNr()) {Audiold3 = Audiold1; Audiold1 = _cur_AudioFileNr;} const char* r = lst_PLAYER.getSelectedFile(); if(r){stopSong(); SD_playFile(lst_PLAYER.getSelectedFilePath(), 0, true); _cur_AudioFileNr = lst_PLAYER.getSelectedFileNr(); if(Audiold1 != _cur_AudioFileNr) Audiold2 = _cur_AudioFileNr; if(_state2 == CLOCK) {_clockSubMenue = 0; changeState(CLOCK);} else {_playerSubMenue = 1; changeState(PLAYER);}} break; }
					if(_state == BLUETOOTH) {if(_f_BTpower) {bt_emitter.pauseResume(); btn_BT_pause.showClickedPic(); vTaskDelay(100); btn_BT_pause.show();} break;}
					if(_state1 == PLAYER) {changeState(AUDIOFILESLIST); setTimeCounter(8); break;}
					if(_state1 == RADIO) {changeState(STATIONSLIST); setTimeCounter(8); break;}
					if(_state1 == DLNA) {changeState(DLNAITEMSLIST); txt_DL_fName.setText(""); setTimeCounter(8); break;}
                    break;
		case 17:    // CLOCK
					if(_state == CLOCK) {_state2 = UNDEFINED; SubMenueAll(); break;}
					_clockSubMenue = 0; changeState(CLOCK); _state2 = CLOCK; break;
		case 18:    // SLEEP TIMER
					if(_state == SLEEPTIMER) {SubMenueAll(); break;}					
					if(_state == BLUETOOTH) {if(disptimer55) {btn_SE_bright.showClickedPic(); vTaskDelay(100); btn_SE_bright.show(); vTaskDelay(500);} else {btn_SE_equal.showClickedPic(); vTaskDelay(100); btn_SE_equal.show(); vTaskDelay(500);} changeState(BRIGHTNESS); break;}
					if(_state == BRIGHTNESS) {changeState(BLUETOOTH); break;}
					_sleepTimerSubMenue = 0; changeState(SLEEPTIMER); break;
		case 19:    // CHANGE SubMenue
					if(_state == BLUETOOTH) {if(disptimer55) {btn_SE_bright.showClickedPic(); vTaskDelay(100); btn_SE_bright.show(); vTaskDelay(500);} else {btn_SE_equal.showClickedPic(); vTaskDelay(100); btn_SE_equal.show(); vTaskDelay(500);} changeState(BRIGHTNESS); break;}
					if(_state == BRIGHTNESS) {changeState(BLUETOOTH); break;}
					if(_radioSubMenue == 4) _radioSubMenue = -1;
					if(_playerSubMenue == 4) _playerSubMenue = -1;
					if(_state1 == RADIO) {if(!audio.isRunning()) connecttohost(_settings.lastconnectedhost); if(_radioSubMenue == 2) _radioSubMenue +=2; else _radioSubMenue ++; changeState(RADIO);} else {if(_state1 == PLAYER) {if(!audio.isRunning()) {_f_shuffle = true; preparePlaylistFromSDFolder(_cur_AudioFolder); processPlaylist(true);} _playerSubMenue ++; changeState(PLAYER);}}
					if(_state2 == CLOCK) { _clockSubMenue = 0; changeState(CLOCK);} 
					break;
		case 20:    _f_irOnOff = ! _f_irOnOff;
                    if(_f_irOnOff) fall_asleep();
                    else           wake_up();
                    break;
		case 21:    // PLAYLIST PLAY
					btn_PL_playAll.showClickedPic(); vTaskDelay(100); btn_PL_playAll.show(); vTaskDelay(100); _f_shuffle = false; preparePlaylistFromSDFolder(_cur_AudioFolder); processPlaylist(true); Audiold2 = _cur_AudioFileNr; _state1 = PLAYER; SubMenueAll(); break;
		case 22:    // PLAYLIST SHUFFLE PLAY
					btn_PL_shuffle.showClickedPic(); vTaskDelay(100); btn_PL_shuffle.show(); vTaskDelay(100);
					if(_state1 == RADIO) {_cur_station = random(1, staMgnt.getSumStations() + 1); if(_cur_station) setStation(_cur_station); else connecttohost(_settings.lastconnectedhost); Stationold2 = _cur_station;} else if(_state1 == PLAYER) {_f_shuffle = true; preparePlaylistFromSDFolder(_cur_AudioFolder); processPlaylist(true); Audiold2 = _cur_AudioFileNr;} SubMenueAll(); break;
		case 23:    if(_state1 == PLAYER) {if(audio.isRunning()) audio.setTimeOffset(-30);} else if(_state1 == RADIO) {prevStation(); Stationold2 = _cur_station;} btn_RA_prevSta.showClickedPic(); vTaskDelay(100); btn_RA_prevSta.show(); vTaskDelay(100); SubMenueAll(); break;
		case 24:    if(_state1 == PLAYER) {if(audio.isRunning()) audio.setTimeOffset(+30);} else if(_state1 == RADIO) {nextStation(); Stationold2 = _cur_station;} btn_RA_nextSta.showClickedPic(); vTaskDelay(100); btn_RA_nextSta.show(); vTaskDelay(100); SubMenueAll(); break;
		case 25:	if(audio.isRunning()) btn_PL_pause.setOn(); else btn_PL_pause.setOff();
					btn_PL_pause.showClickedPic(); vTaskDelay(100); btn_PL_pause.show(); vTaskDelay(100);
					if(!audio.isRunning()) {if(_state1 == RADIO) connecttohost(_settings.lastconnectedhost); else if(_state1 == PLAYER) {SD_playFile(_cur_AudioFolder, _SD_content.getColouredSStringByIndex(_cur_AudioFileNr));}} else _f_pauseResume = audio.pauseResume();
					break;
        case 26:    btn_PL_cancel.showClickedPic(); vTaskDelay(100); btn_PL_cancel.show(); vTaskDelay(100); stopSong(); break;
		case 27:    btn_PL_playAll.showClickedPic(); vTaskDelay(100); btn_PL_playAll.show(); vTaskDelay(100); if(_state1 == RADIO) setStationByNumber(_cur_station); else if(_state1 == PLAYER) SD_playFile(_cur_AudioFolder, _SD_content.getColouredSStringByIndex(_cur_AudioFileNr)); SubMenueAll();
					break;
		case 28:	if(!disptimer) {dispOff = !dispOff; if(dispOff) {brightallm(); setTFTbrightness(0);} else brightallp();} else {if(_disptimer2) brightallm(); else brightallp();} break;
		case 29:	if(_state == RADIO) {
					if(_radioSubMenue != 4) {_radioSubMenue = 4; changeState(RADIO); setTimeCounter(LIST_TIMER);	break;}
					if(_radioSubMenue == 4) {_radioSubMenue = 0; changeState(RADIO);} break;}
                    if(_state == PLAYER){
                    if(_playerSubMenue == 0){_playerSubMenue = 2; changeState(PLAYER); setTimeCounter(LIST_TIMER); break;}
                    if(_playerSubMenue == 1){_playerSubMenue = 3; changeState(PLAYER); setTimeCounter(LIST_TIMER); break;}
					if(_playerSubMenue == 2){_playerSubMenue = 0; changeState(PLAYER); setTimeCounter(2); break;}
                    if(_playerSubMenue == 3){_playerSubMenue = 1; changeState(PLAYER); setTimeCounter(2);} break;}
					if(_state == DLNA) {
					if(_dlnaSubMenue == 0) { _dlnaSubMenue = 1; changeState(DLNA); setTimeCounter(LIST_TIMER); break;}
					if(_dlnaSubMenue == 1) { _dlnaSubMenue = 0; changeState(DLNA);} break;}
					if(_state == CLOCK){
					if(_clockSubMenue == 0) { _clockSubMenue = 2; changeState(CLOCK); setTimeCounter(LIST_TIMER);  break;}
                    if(_clockSubMenue == 1) { _clockSubMenue = 2; changeState(CLOCK); setTimeCounter(LIST_TIMER);  break;}
					if(_clockSubMenue == 2) { _clockSubMenue = 0; changeState(CLOCK);} break;}
					if(_state == ALARMCLOCK){
                    if(_alarmSubMenue == 0) { _alarmSubMenue = 1; changeState(ALARMCLOCK); setTimeCounter(LIST_TIMER); break;}
					if(_alarmSubMenue == 1) { _alarmSubMenue = 0; changeState(ALARMCLOCK);} break;}
					if(_state == SLEEPTIMER) {
                    if(_sleepTimerSubMenue == 0){_sleepTimerSubMenue = 1; changeState(SLEEPTIMER); setTimeCounter(LIST_TIMER); break;}
					if(_sleepTimerSubMenue == 1){_sleepTimerSubMenue = 0; changeState(SLEEPTIMER);} break;}
					if(_state == SETTINGS){
                    if(_settingsSubMenue == 0){_settingsSubMenue = 1; changeState(SETTINGS); setTimeCounter(LIST_TIMER); break;}
					if(_settingsSubMenue == 1){_settingsSubMenue = 0; changeState(SETTINGS);} break;}
					if(_state == BRIGHTNESS){
                    if(_brightnessSubMenue == 0){_brightnessSubMenue = 1; changeState(BRIGHTNESS); setTimeCounter(LIST_TIMER); break;}
					if(_brightnessSubMenue == 1){_brightnessSubMenue = 0; changeState(BRIGHTNESS);} break;}
					if(_state == EQUALIZER){
                    if(_equalizerSubMenue == 0){_equalizerSubMenue = 1; changeState(EQUALIZER); setTimeCounter(LIST_TIMER); break;}
					if(_equalizerSubMenue == 1){_equalizerSubMenue = 0; changeState(EQUALIZER);} break;}
					default:    break;
    }
}
void ir_long_key(int8_t key) {
	if(_f_irOnOff) return; else if(disptimer) _disptimer2 = _disptimer; brightallp();
		if(key == 11 || key == 12 || key == 27) {if(_clockSubMenue == 0 && _state != DLNA && _state != ALARMCLOCK && _state != SLEEPTIMER && _state != SETTINGS && _state != BRIGHTNESS && _state != EQUALIZER && _state != BLUETOOTH) {if(_state1 == PLAYER && _playerSubMenue <= 1 && _state != AUDIOFILESLIST) {Audiold3 = Audiold1; Audiold1 = _cur_AudioFileNr;} if(_state1 == RADIO && _radioSubMenue <= 1 && _state != STATIONSLIST) {Stationold3 = Stationold1; Stationold1 = _cur_station;}}}
    if(key == 28) {disptimer = !disptimer; // LONG DISPTIMER
	brightallp();}
	if(key != 28 && key != 19 && key != 18 && key != 11 && key != 12 && key != 13 && key != 14 && key != 27) { // LONG CANCEL/PAUSE/PLAY
	if(!audio.isRunning()) btn_PL_pause.setOn(); else btn_PL_pause.setOff();
	if(_state == RADIO || _state == CLOCK || _state == PLAYER || _state == DLNA) {if(!audio.isRunning()) {if(_state1 == RADIO) connecttohost(_settings.lastconnectedhost); else if(_state1 == PLAYER) {_f_shuffle = true; preparePlaylistFromSDFolder(_cur_AudioFolder); processPlaylist(true);} btn_PL_pause.showClickedPic(); vTaskDelay(100); btn_PL_pause.show(); vTaskDelay(200);} else {btn_PL_cancel.showClickedPic(); vTaskDelay(100); btn_PL_cancel.show(); vTaskDelay(200); stopSong();}} else {btn_PL_cancel.showClickedPic(); vTaskDelay(100); btn_PL_cancel.show(); vTaskDelay(200);}SubMenueAll();}
	if(key == 19) {// LONG SETUP
				  if(disptimer55) {btn_SE_bright.showClickedPic(); vTaskDelay(100); btn_SE_bright.show(); vTaskDelay(500); txt_BR_value.setText(int2str(current_brightness));txt_BR_value.show(true, true);} else {btn_SE_equal.showClickedPic(); vTaskDelay(100); btn_SE_equal.show(); vTaskDelay(500); txt_BR_value.setText(int2str(_disptimer3));txt_BR_value.show(true, true);}changeState(BRIGHTNESS); 
				  }
	if(key == 18)  {changeState(BLUETOOTH);}
	if(key == 11)	{btn_RA_nextSta.showClickedPic(); vTaskDelay(150); btn_RA_nextSta.show(); vTaskDelay(150); if(_state1 == PLAYER) {if(audio.isRunning()) audio.setTimeOffset(+30);} else if(_state1 == RADIO) {nextStation(); Stationold2 = _cur_station;} SubMenueAll();}
	if(key == 12)	{btn_RA_prevSta.showClickedPic(); vTaskDelay(150); btn_RA_prevSta.show(); vTaskDelay(150);if(_state1 == PLAYER) {if(audio.isRunning()) audio.setTimeOffset(-30);} else if(_state1 == RADIO) {prevStation(); Stationold2 = _cur_station;} SubMenueAll();}
	if(key == 13)	{btn_PL_cancel.showClickedPic(); vTaskDelay(100); btn_PL_cancel.show(); vTaskDelay(100); stopSong();}
	if(key == 14)	{if(audio.isRunning()) btn_PL_pause.setOn(); else btn_PL_pause.setOff();
					btn_PL_pause.showClickedPic(); vTaskDelay(100); btn_PL_pause.show(); vTaskDelay(100);
					if(!audio.isRunning()) {if(_state1 == RADIO) connecttohost(_settings.lastconnectedhost); else if(_state1 == PLAYER) {SD_playFile(_cur_AudioFolder, _SD_content.getColouredSStringByIndex(_cur_AudioFileNr));}} else _f_pauseResume = audio.pauseResume();}
	if(key == 27)	{btn_PL_shuffle.showClickedPic(); vTaskDelay(100); btn_PL_shuffle.show(); vTaskDelay(100);
	_cur_station = random(1, staMgnt.getSumStations() + 1); if(_state1 == RADIO) {if(_cur_station) setStation(_cur_station); else connecttohost(_settings.lastconnectedhost); Stationold2 = _cur_station;} else if(_state1 == PLAYER) { _f_shuffle = true; preparePlaylistFromSDFolder(_cur_AudioFolder); processPlaylist(true); Audiold2 = _cur_AudioFileNr;} SubMenueAll();}
}
//----------------------------------------------------------------------------------------------------------------------------------------------------
// Event from TouchPad
// clang-format off
void tp_pressed(uint16_t x, uint16_t y) {
    //  SerialPrintfln(ANSI_ESC_YELLOW "Touchpoint  x=%d, y=%d", x, y);
    if(_f_sleeping || !_disptimer2) return;  // awake in tp_released()
    const char* objName = NULL;
    if(_state == RADIO && y > _winHeader.y + _winHeader.h && y < _sdrOvBtns.y){
        objName = "backpane";
        _radioSubMenue++;
        if(_radioSubMenue == 3) _radioSubMenue = 0;
        changeState(RADIO);
        goto exit;
    }
    objName = isObjectClicked(x, y);
exit:
    if(objName){
        SerialPrintfln("click on ..  %s", objName);
    }
    return;
}
void tp_long_pressed(uint16_t x, uint16_t y){

